-- MySQL dump 10.13  Distrib 8.0.37, for Win64 (x86_64)
--
-- Host: localhost    Database: aezen
-- ------------------------------------------------------
-- Server version	8.0.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `alert`
--

DROP TABLE IF EXISTS `alert`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `alert` (
  `alert_no` int NOT NULL AUTO_INCREMENT COMMENT '알림 고유번호',
  `id` varchar(50) NOT NULL COMMENT '알림을 받는 사람 ID (user.id 참조)',
  `alert_id` varchar(50) NOT NULL COMMENT '알림을 발생시킨 ID (user.id 참조)',
  `alert_type` int NOT NULL COMMENT '알림 종류 (1:댓글, 2:좋아요, 3:팔로우, 4:답변 채택, 5:기타)',
  `alert_content` text COMMENT '알림 내용',
  `alerted_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '알림 발생 일시',
  `target_board_no` int DEFAULT NULL COMMENT '알림 클릭시 이동할 게시글 고유번호 (board.board_no 참조)',
  `target_comment_answer_no` int DEFAULT NULL COMMENT '알림 클릭시 이동할 댓글/답변 고유번호 (comment_answer.comment_answer_no 참조)',
  PRIMARY KEY (`alert_no`),
  KEY `fk_alert_receiver_id` (`id`),
  KEY `fk_alert_sender_id` (`alert_id`),
  KEY `fk_alert_board_no` (`target_board_no`),
  KEY `fk_alert_comment_no` (`target_comment_answer_no`),
  CONSTRAINT `fk_alert_board_no` FOREIGN KEY (`target_board_no`) REFERENCES `board` (`board_no`),
  CONSTRAINT `fk_alert_comment_no` FOREIGN KEY (`target_comment_answer_no`) REFERENCES `comment_answer` (`comment_answer_no`),
  CONSTRAINT `fk_alert_receiver_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`),
  CONSTRAINT `fk_alert_sender_id` FOREIGN KEY (`alert_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `alert`
--

LOCK TABLES `alert` WRITE;
/*!40000 ALTER TABLE `alert` DISABLE KEYS */;
INSERT INTO `alert` VALUES (1,'1','dev_user2',1,'새 댓글이 달렸습니다.','2025-10-15 11:40:29',1,NULL),(2,'1','dev_user3',3,'새 팔로우 알림.','2025-10-15 11:40:29',NULL,NULL),(3,'1','dev_user1',1,'dev_user님이 댓글을 남기셨습니다','2025-10-21 18:04:40',30,1),(4,'1','dev_user1',1,'dev_user1님이 게시글에 댓글을 남겼습니다.','2025-10-20 10:11:22',11,1),(5,'1','user1',2,'user1님이 게시글을 좋아합니다.','2025-10-20 11:12:33',11,NULL),(6,'1','dev_user3',3,'새 팔로워가 생겼습니다.','2025-10-20 12:14:20',NULL,NULL),(7,'1','dev_user2',1,'dev_user2님이 댓글을 남기셨습니다.','2025-10-21 09:25:50',12,2),(8,'1','dev_user4',4,'회원님이 게시글에 태그되었습니다.','2025-10-21 10:30:45',13,NULL),(9,'1','admin',1,'관리자가 댓글을 남겼습니다.','2025-10-21 14:42:30',14,3),(10,'1','dev_user1',2,'새로운 좋아요 알림입니다.','2025-10-22 09:55:10',15,NULL),(12,'dev_user1','1',4,'운영팀에서 회원님을 언급했습니다.','2025-10-22 17:00:00',16,NULL),(13,'1','ezen_user123',1,'ezen_user123님이 댓글을 남기셨습니다.','2025-10-23 08:12:11',17,5);
/*!40000 ALTER TABLE `alert` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `block`
--

DROP TABLE IF EXISTS `block`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `block` (
  `blocker_id` varchar(50) NOT NULL COMMENT '차단한 사용자 ID (user.id 참조)',
  `blocked_id` varchar(50) NOT NULL COMMENT '차단당한 사용자 ID (user.id 참조)',
  `blocked_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '차단 설정 일시',
  PRIMARY KEY (`blocker_id`,`blocked_id`),
  KEY `fk_block_blocked_id` (`blocked_id`),
  CONSTRAINT `fk_block_blocked_id` FOREIGN KEY (`blocked_id`) REFERENCES `user` (`id`),
  CONSTRAINT `fk_block_blocker_id` FOREIGN KEY (`blocker_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `block`
--

LOCK TABLES `block` WRITE;
/*!40000 ALTER TABLE `block` DISABLE KEYS */;
INSERT INTO `block` VALUES ('dev_user1','dev_user2','2025-10-15 11:40:29'),('dev_user2','admin_user','2025-10-15 11:40:29');
/*!40000 ALTER TABLE `block` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `board`
--

DROP TABLE IF EXISTS `board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `board` (
  `board_no` int NOT NULL AUTO_INCREMENT COMMENT '게시글 고유번호',
  `id` varchar(50) NOT NULL COMMENT '작성자 아이디 (user.id 참조)',
  `board_title` varchar(255) NOT NULL COMMENT '글 제목',
  `board_content` text NOT NULL COMMENT '글 내용',
  `board_category` int DEFAULT NULL COMMENT '글 카테고리 1: 자유 2:Q&A 3:코딩테스트 4:공지사항 5:이용약관 6:개인정보처리방침',
  `hit` int NOT NULL DEFAULT '0' COMMENT '조회수',
  `board_like` int NOT NULL DEFAULT '0' COMMENT '추천수',
  `board_dislike` int NOT NULL DEFAULT '0' COMMENT '비추천수',
  `board_created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '작성일시',
  `board_updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '수정일시',
  `board_deleted` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`board_no`),
  KEY `id` (`id`),
  CONSTRAINT `board_ibfk_1` FOREIGN KEY (`id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=205 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `board`
--

LOCK TABLES `board` WRITE;
/*!40000 ALTER TABLE `board` DISABLE KEYS */;
INSERT INTO `board` VALUES (1,'dev_user1','MySQL 쿼리 속도 개선 질문 (1번글)','긴글예시 / 긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  긴글예시 /  ',2,2994,100,51,'2025-10-15 11:40:29','2025-11-27 14:45:59',0),(2,'dev_user2','주말 개발 일지 공유 (2번글)','토요일에 새로운 리액트 프로젝트를 시작했어요.',1,2981,94,50,'2025-10-15 11:40:29','2025-11-26 15:40:08',0),(3,'admin_user','서비스 점검 안내 (3번글)','10월 14일 오전 2시부터 4시까지 정기 점검이 있습니다.',4,2970,91,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(4,'dev_user1','Q&A: 인덱스 최적화 방안 (4번글)','대용량 테이블에서 인덱스 설계 고민 중입니다.',2,2961,88,50,'2025-10-15 11:40:29','2025-11-26 15:40:11',0),(5,'dev_user2','자유: 새로운 개발 환경 구축 후기 (5번글)','VS Code 테마를 바꿔봤는데 생산성이 올랐습니다.',1,2950,85,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(6,'dev_user3','팁: 유용한 Git 명령어 모음 (6번글)','git rebase, reflog 사용법 정리.',5,2940,82,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(7,'dev_user4','Q&A: CSS 레이아웃 질문 (7번글)','Flexbox와 Grid 중 어떤 것을 써야 할까요?',2,2931,79,50,'2025-10-15 11:40:29','2025-11-26 15:40:18',0),(8,'admin_user','공지: 커뮤니티 가이드라인 업데이트 (8번글)','보다 건전한 환경을 위해 일부 규칙이 변경됩니다.',4,2920,76,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(9,'dev_user1','Q&A: 트랜잭션 격리 수준 문의 (9번글)','Repeatable Read와 Read Committed의 차이는 무엇인가요?',2,2911,73,50,'2025-10-15 11:40:29','2025-11-27 14:46:19',0),(10,'dev_user2','자유: 개발자 컨퍼런스 후기 (10번글)','이번 코넥스에서 좋은 강연을 들었습니다.',1,2902,71,50,'2025-10-15 11:40:29','2025-11-27 14:00:59',0),(11,'dev_user3','팁: TypeScript 기본 세팅 가이드 (11번글)','프로젝트 시작 시 타입스크립트 설정을 쉽게 하는 방법.',5,2890,67,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(12,'dev_user4','자유: 주말에 읽은 IT 도서 추천 (12번글)','Clean Code를 다시 읽어봤습니다.',1,2880,64,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(13,'dev_user1','Q&A: 서버 배포 자동화 문의 (13번글)','CI/CD 파이프라인 구축 관련 조언 부탁드립니다.',2,2870,61,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(14,'dev_user2','팁: React Custom Hook 작성법 (14번글)','재사용 가능한 로직을 Hook으로 만들어보세요.',5,2860,58,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(15,'dev_user3','Q&A: NoSQL DB 도입 고민 (15번글)','MongoDB와 Cassandra 중 어떤 것이 좋을까요?',2,2850,55,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(16,'dev_user4','자유: 코딩 테스트 준비 팁 공유 (16번글)','매일 한 문제씩 푸는 것이 중요합니다.',1,2840,52,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(17,'admin_user','공지: 서버 안정화 작업 완료 보고 (17번글)','오후 3시에 정상 서비스로 복귀했습니다.',4,2830,49,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(18,'dev_user1','팁: 복잡한 SQL 쿼리 최적화 노하우 (18번글)','JOIN 순서와 서브쿼리 활용 팁.',5,2820,46,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(19,'dev_user2','Q&A: OAuth 2.0 구현 문의 (19번글)','인가 코드 흐름(Authorization Code Flow) 구현이 어렵습니다.',2,2810,43,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(20,'dev_user3','자유: 사이드 프로젝트 아이디어 공유 (20번글)','날씨 기반 레시피 추천 앱을 만들어보려 합니다.',1,2801,40,50,'2025-10-15 11:40:29','2025-11-27 13:03:15',0),(21,'dev_user4','팁: Docker Compose 기본 사용법 (21번글)','개발 환경을 컨테이너로 통일하세요.',5,2791,10,50,'2025-10-15 11:40:29','2025-11-27 13:03:28',0),(22,'dev_user1','Q&A: RESTful API 설계 질문 (22번글)','PUT과 PATCH 사용 기준이 헷갈립니다.',2,2780,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(23,'dev_user2','자유: 회사에서 사용하는 기술 스택 소개 (23번글)','저희 팀은 주로 Kotlin과 Spring Boot를 사용합니다.',1,2770,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(24,'dev_user3','Q&A: Front-end 성능 최적화 문의 (24번글)','렌더링 속도를 높이는 방법을 알고 싶습니다.',2,2760,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(25,'dev_user4','팁: VS Code 유용한 확장 프로그램 (25번글)','필수 확장 프로그램 5가지 추천.',5,2750,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(26,'admin_user','공지: 신규 운영진 모집 안내 (26번글)','커뮤니티와 함께 성장할 분을 찾습니다.',4,2740,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(27,'dev_user1','Q&A: Python 가상 환경 설정 (27번글)','venv 사용법에 대한 질문입니다.',2,2730,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(28,'dev_user2','자유: 최신 AI 동향 분석 (28번글)','LLM의 발전 속도가 무섭습니다.',1,2720,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(29,'dev_user3','팁: 크롬 개발자 도구 활용법 (29번글)','네트워크 탭과 퍼포먼스 탭 심층 분석.',5,2710,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(30,'dev_user4','Q&A: AWS S3 권한 설정 질문 (30번글)','IAM 정책 설정이 복잡합니다.',2,2701,10,50,'2025-10-15 11:40:29','2025-11-27 13:03:07',0),(31,'dev_user1','자유: 퇴근 후 취미 생활 공유 (31번글)','저는 주말에 드론 코딩을 합니다.',1,2690,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(32,'dev_user2','팁: 정규 표현식 마스터하기 (32번글)','복잡한 문자열 패턴을 쉽게 처리하세요.',5,2680,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(33,'dev_user3','Q&A: Redis 캐시 사용 질문 (33번글)','캐시 무효화 전략에 대해 조언 부탁드립니다.',2,2670,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(34,'dev_user4','자유: 블로그 시작 결심 (34번글)','오늘부터 개발 블로그를 운영하려 합니다.',1,2660,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(35,'admin_user','공지: 설문조사 참여 요청 (35번글)','서비스 개선을 위한 사용자 설문입니다.',4,2650,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(36,'dev_user1','팁: 함수형 프로그래밍 이해하기 (36번글)','불변성과 순수 함수 개념 정리.',5,2640,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(37,'dev_user2','Q&A: 웹 보안 XSS 방어 (37번글)','Input Sanitization 관련 문의입니다.',2,2630,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(38,'dev_user3','자유: 팀 프로젝트 회고록 (38번글)','이번 프로젝트에서 배운 점들을 공유합니다.',1,2620,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(39,'dev_user4','팁: Postman 활용 A to Z (39번글)','API 테스트 환경 구축 및 활용.',5,2610,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(40,'dev_user1','Q&A: HTTP/3 프로토콜 문의 (40번글)','QUIC에 대한 기본적인 질문입니다.',2,2600,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(41,'dev_user2','자유: 개발자에게 필요한 소프트 스킬 (41번글)','커뮤니케이션 능력이 중요합니다.',1,2590,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(42,'dev_user3','팁: Shell Script 작성 기초 (42번글)','간단한 자동화 스크립트 작성법.',5,2580,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(43,'dev_user4','Q&A: Design Pattern 적용 고민 (43번글)','Facade 패턴이 적절한 상황인가요?',2,2570,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(44,'admin_user','공지: 연말 오프라인 모임 안내 (44번글)','개발자 네트워킹 행사를 개최합니다.',4,2560,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(45,'dev_user1','팁: 메모리 관리의 중요성 (45번글)','Garbage Collection의 동작 방식.',5,2550,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(46,'dev_user2','Q&A: 웹소켓(WebSocket) 구현 질문 (46번글)','실시간 채팅 기능 구현이 어렵습니다.',2,2540,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(47,'dev_user3','자유: 새로운 언어 학습 도전 (47번글)','Rust를 배우기 시작했습니다.',1,2530,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(48,'dev_user4','팁: Markdown 문법 완벽 정리 (48번글)','문서 작성에 유용한 마크다운 팁.',5,2520,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(49,'dev_user1','Q&A: DB 샤딩(Sharding) 적용 문의 (49번글)','데이터 분산 전략 관련 조언을 구합니다.',2,2510,10,50,'2025-10-15 11:40:29','2025-10-24 09:14:15',0),(50,'dev_user2','자유: 면접에서 받았던 인상적인 질문 (50번글)','기술 면접 후기를 공유합니다.',1,2501,10,50,'2025-10-15 11:40:29','2025-11-27 13:02:56',0),(52,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2490,10,50,'2025-10-16 11:45:20','2025-10-24 09:14:15',0),(53,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2480,10,50,'2025-10-16 11:46:30','2025-10-24 09:14:15',0),(54,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2470,10,50,'2025-10-16 11:46:51','2025-10-24 09:14:15',0),(55,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2460,10,50,'2025-10-17 15:16:40','2025-10-24 09:14:15',0),(56,'user019','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2450,10,50,'2025-10-17 15:16:43','2025-11-26 15:19:21',0),(57,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2440,10,50,'2025-10-17 15:16:43','2025-10-24 09:14:15',0),(58,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2430,10,50,'2025-10-17 15:16:43','2025-10-24 09:14:15',0),(59,'1','? 중요한 서비스 변경 및 업데이트 안내','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',4,2420,10,50,'2025-10-17 15:16:44','2025-10-24 09:14:15',0),(60,'1','? 코딩 테스트 문제 풀이 노하우 공유','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',3,2410,10,50,'2025-10-17 15:17:18','2025-10-24 09:14:15',0),(61,'1','? 코딩 테스트 문제 풀이 노하우 공유','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',3,2400,10,50,'2025-10-17 15:17:19','2025-10-24 09:14:15',0),(62,'1','? 코딩 테스트 문제 풀이 노하우 공유','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',3,2390,10,50,'2025-10-17 15:17:19','2025-10-24 09:14:15',0),(63,'1','? 코딩 테스트 문제 풀이 노하우 공유','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',3,2380,10,50,'2025-10-17 15:17:19','2025-10-24 09:14:15',0),(64,'1','? 코딩 테스트 문제 풀이 노하우 공유','이 내용은 카테고리에 맞게 일괄적으로 수정된 내용입니다.',3,2370,10,50,'2025-10-17 15:17:19','2025-10-24 09:14:15',0),(65,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 65)',1,2360,10,50,'2025-10-20 14:16:31','2025-10-24 09:14:15',0),(66,'1','Q&A: 웹 개발 관련 질문 #66','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 66)',2,2350,10,50,'2025-10-20 14:19:27','2025-10-24 09:14:15',0),(67,'1','코딩 테스트 후기: 알고리즘 복습 기록 67','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 67)',3,2340,10,50,'2025-10-20 14:19:54','2025-10-24 09:14:15',0),(68,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 68)',1,2330,10,50,'2025-10-20 14:20:22','2025-10-24 09:14:15',0),(69,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 69)',1,2320,10,50,'2025-10-20 14:20:36','2025-10-24 09:14:15',0),(70,'1','Q&A: 웹 개발 관련 질문 #70','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 70)',2,2310,10,50,'2025-10-20 16:01:53','2025-10-24 09:14:15',0),(71,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 71)',1,2300,10,50,'2025-10-20 16:03:19','2025-10-24 09:14:15',0),(72,'1','Q&A: 웹 개발 관련 질문 #72','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 72)',2,2290,10,50,'2025-10-20 16:03:48','2025-10-24 09:14:15',0),(73,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 73)',1,2280,10,50,'2025-10-20 16:33:24','2025-10-24 09:14:15',0),(74,'1','ㅁㄴㅇㄻㄴ','ㅁㄴㅇㄻㄴㅇㄹ',2,2270,10,50,'2025-10-20 16:34:00','2025-10-24 09:14:15',1),(75,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 75)',1,2260,10,50,'2025-10-20 16:34:22','2025-10-24 09:14:15',0),(76,'1','코딩 테스트 후기: 알고리즘 복습 기록 76','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 76)',3,2250,10,50,'2025-10-20 16:35:26','2025-10-24 09:14:15',0),(77,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 77)',1,2240,10,50,'2025-10-20 16:35:40','2025-10-24 09:14:15',0),(78,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 78)',1,2230,10,50,'2025-10-20 17:47:31','2025-10-24 09:14:15',0),(79,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 79)',1,2220,10,50,'2025-10-20 17:58:25','2025-10-24 09:14:15',0),(80,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 80)',1,2210,10,50,'2025-10-20 18:06:03','2025-10-24 09:14:15',0),(81,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 81)',1,2200,10,50,'2025-10-20 18:22:19','2025-10-24 09:14:15',0),(82,'1','자유 게시판 글: 10/20의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 82)',1,2190,10,50,'2025-10-20 18:22:35','2025-10-24 09:14:15',0),(83,'1','ㄷㄷ','ㄷㄷ',1,2180,10,50,'2025-10-20 18:22:59','2025-10-24 09:14:15',1),(84,'1','ㄹㄹㄹㅁㄴㅇㄻㄴㅇㄹ','ㅀㄹㄹㅁㄴㅇㄹㅍㅍㅍㅍ',2,2170,10,50,'2025-10-20 18:33:20','2025-10-24 09:14:15',1),(85,'1','ㅓㅓㅓ','ㅓㅓㅓ',2,2160,10,50,'2025-10-21 09:13:05','2025-10-24 09:14:15',1),(86,'1','ㅏㅏㅏ','ㅏㅏㅏ',2,2150,10,50,'2025-10-21 09:18:36','2025-10-24 09:14:15',1),(87,'1','ㅏㅏ','ㅏㅏ',1,2140,10,50,'2025-10-21 09:24:11','2025-10-24 09:14:15',1),(88,'1','ㅏㅏ','ㅏㅏ',1,2130,10,50,'2025-10-21 09:26:06','2025-10-24 09:14:15',1),(89,'1','ㅏㅏ','ㅏㅏ',1,2120,10,50,'2025-10-21 09:32:26','2025-10-24 09:14:15',1),(90,'1','ㅏㅏ','ㅏㅏ',1,2110,10,50,'2025-10-21 09:35:48','2025-10-24 09:14:15',1),(91,'1','ㅏㅏ','ㅏㅏ',1,2100,10,50,'2025-10-21 09:45:12','2025-10-24 09:14:15',1),(92,'1','ㅏㅏ','ㅏㅏ',1,2090,10,50,'2025-10-21 09:51:57','2025-10-24 09:14:15',1),(93,'1','ㅏㅏ','ㅏㅏ',1,2080,10,50,'2025-10-21 09:54:46','2025-10-24 09:14:15',1),(94,'1','11','11',1,2070,10,50,'2025-10-21 09:55:25','2025-10-24 09:14:15',1),(95,'1','ㅏㅏ','ㅏㅏ',1,2060,10,50,'2025-10-21 10:06:23','2025-10-24 09:14:15',1),(96,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 96)',1,2050,10,50,'2025-10-21 10:21:12','2025-10-24 09:14:15',0),(97,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 97)',1,2041,10,50,'2025-10-21 10:23:08','2025-11-26 13:02:30',0),(98,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 98)',1,2030,10,50,'2025-10-21 10:31:03','2025-10-24 09:14:15',0),(99,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 99)',1,2020,10,50,'2025-10-21 10:37:45','2025-10-24 09:14:15',0),(100,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 100)',1,2010,10,50,'2025-10-21 10:43:59','2025-10-24 09:14:15',0),(101,'1','공지사항: 커뮤니티 운영 관련 주요 안내 #101','이 게시글은 카테고리 4의 일괄 수정된 내용입니다. (게시글 번호: 101)',4,2000,402,5,'2025-10-21 10:58:00','2025-10-24 09:14:15',0),(102,'1','이용약관 변경사항 안내 (Ver. 102)','이 게시글은 카테고리 5의 일괄 수정된 내용입니다. (게시글 번호: 102)',5,1990,404,5,'2025-10-21 10:58:09','2025-11-24 14:42:59',1),(103,'1','44','44',6,1980,406,5,'2025-10-21 10:58:15','2025-10-24 09:14:15',1),(104,'1','개인정보처리방침 개정 알림 (Ver. 104)','이 게시글은 카테고리 6의 일괄 수정된 내용입니다. (게시글 번호: 104)',6,1970,408,5,'2025-10-21 11:01:10','2025-10-24 09:14:15',0),(105,'1','1234','1234',1,1960,410,5,'2025-10-21 12:42:46','2025-10-24 09:14:15',1),(106,'1','ㄴㅇㅀ','ㄴㅇㄹㄴㅇㄹㄴㅇㄹ',2,1950,412,5,'2025-10-21 12:43:06','2025-10-24 09:14:15',1),(107,'1','코딩 테스트 후기: 알고리즘 복습 기록 107','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 107)',3,1940,414,5,'2025-10-21 14:55:16','2025-10-24 09:14:15',0),(108,'1','ㅁㄴㅇㄹ','ㅁㄴㅇㄹ',4,1930,416,5,'2025-10-21 15:29:59','2025-10-24 09:14:15',1),(109,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 109)',1,1921,418,5,'2025-10-21 16:29:27','2025-11-26 13:02:46',0),(110,'1','1ㅁ','ㅁㄴㅇㅁㄴㅇ',1,1910,420,5,'2025-10-21 16:29:40','2025-10-24 09:14:15',1),(111,'1','Q&A: 웹 개발 관련 질문 #111','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 111)',2,1900,422,5,'2025-10-21 16:47:18','2025-10-24 09:14:15',0),(112,'1','갤럭시','갤럭시',1,1890,424,5,'2025-10-21 17:21:52','2025-10-24 09:14:15',1),(113,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 113)',1,1880,426,5,'2025-10-21 17:28:47','2025-10-24 09:14:15',0),(114,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 114)',1,1870,428,5,'2025-10-21 17:34:47','2025-10-24 09:14:15',0),(115,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 115)',1,1860,430,5,'2025-10-21 17:50:15','2025-10-24 09:14:15',0),(116,'1','자유 게시판 글: 10/21의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 116)',1,1850,432,5,'2025-10-21 17:52:33','2025-10-24 09:14:15',0),(117,'1','코딩 테스트 후기: 알고리즘 복습 기록 117','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 117)',3,1841,434,5,'2025-10-22 08:39:51','2025-11-26 13:02:44',0),(118,'1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 118)',1,1830,436,5,'2025-10-22 08:41:42','2025-10-24 09:14:15',0),(119,'1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 119)',1,1820,438,5,'2025-10-22 08:51:07','2025-10-24 09:14:15',0),(120,'1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 120)',1,1810,440,5,'2025-10-22 08:55:54','2025-10-24 09:14:15',0),(121,'1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 121)',1,1800,10,50,'2025-10-22 08:58:22','2025-10-24 09:14:15',0),(122,'1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 122)',1,1790,10,50,'2025-10-22 09:00:06','2025-10-24 09:14:15',0),(123,'1','Q&A: 웹 개발 관련 질문 #123','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 123)',2,1780,10,50,'2025-10-22 09:10:24','2025-10-24 09:14:15',0),(124,'1','코딩 테스트 후기: 알고리즘 복습 기록 124','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 124)',3,1770,10,50,'2025-10-22 09:10:29','2025-10-24 09:14:15',0),(125,'1','공지사항: 커뮤니티 운영 관련 주요 안내 #125','이 게시글은 카테고리 4의 일괄 수정된 내용입니다. (게시글 번호: 125)',4,1760,10,50,'2025-10-22 09:10:33','2025-10-24 09:14:15',0),(126,'1','공지사항: 커뮤니티 운영 관련 주요 안내 #126','이 게시글은 카테고리 4의 일괄 수정된 내용입니다. (게시글 번호: 126)',4,1750,10,50,'2025-10-22 10:30:17','2025-11-24 14:42:54',1),(127,'1','코딩 테스트 후기: 알고리즘 복습 기록 127','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 127)',3,1740,10,50,'2025-10-22 12:09:34','2025-10-24 09:14:15',0),(128,'1','코딩 테스트 후기: 알고리즘 복습 기록 128','이 게시글은 카테고리 3의 일괄 수정된 내용입니다. (게시글 번호: 128)',3,1730,10,50,'2025-10-22 12:22:57','2025-10-24 09:14:15',0),(129,'1','ㅁㄴㅇㄻㄴㄻㄴ','ㅁㄴㅇㄻㄴㅇㄻㄴㄹ',1,1720,10,50,'2025-10-22 12:33:36','2025-10-24 09:14:15',1),(130,'1','Q&A: 웹 개발 관련 질문 #130','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 130)',2,1710,10,50,'2025-10-22 12:36:13','2025-10-24 09:14:15',0),(131,'user1','Q&A: 웹 개발 관련 질문 #131','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 131)',2,1700,10,50,'2025-10-22 12:52:39','2025-11-24 15:51:44',0),(132,'user1','자유 게시판 글: 10/22의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 132)',1,1691,10,50,'2025-10-22 13:17:53','2025-11-26 13:01:58',0),(133,'user1','test','test1111',3,1682,10,50,'2025-10-22 13:22:59','2025-11-26 13:01:57',0),(134,'1','ㅁㄴㅇㄹ','ㅁㄴㅇㄻㄴㅇㄹ',1,1670,10,50,'2025-10-22 14:55:17','2025-10-24 09:14:15',1),(135,'1','자유 게시판 글: 10/23의 일상','이 게시글은 카테고리 1의 일괄 수정된 내용입니다. (게시글 번호: 135)',1,1661,10,50,'2025-10-23 10:01:45','2025-11-26 13:01:53',0),(136,'1','ㅁㄴㅇ','ㅁㅁㅁㄴㄴㄴㄴㅇㄹㄴㅇㅁㄹ',4,1650,10,50,'2025-10-23 10:02:15','2025-10-24 09:14:15',1),(137,'123','123','123123',3,1640,10,50,'2025-10-23 11:20:42','2025-10-24 09:14:15',1),(138,'123','123124','1231251234',3,1630,10,50,'2025-10-23 11:34:12','2025-10-24 09:14:15',1),(139,'1','Q&A: 웹 개발 관련 질문 #139','이 게시글은 카테고리 2의 일괄 수정된 내용입니다. (게시글 번호: 139)',2,1622,11,51,'2025-10-23 16:55:59','2025-11-27 14:21:41',0),(140,'1','멘토님들 환영합니다!','사랑합니다 감사합니다 행복합니다1',4,4,4,6,'2025-10-24 09:55:52','2025-11-26 13:01:48',0),(141,'1','이미지 테스트용','이미지 테스트용',1,0,2,1,'2025-10-24 09:56:59','2025-11-24 14:27:44',1),(142,'user019','중요 공지 드립니다!','고옹지',4,16,4,3,'2025-10-24 15:12:42','2025-11-26 15:20:34',0),(143,'dev_user1','Python 웹 크롤링 입문','Python BeautifulSoup requests 크롤링 기초',1,0,0,0,'2025-11-26 13:11:46','2025-11-26 13:11:46',0),(144,'user1','React 컴포넌트 구조 이해하기','React useState useEffect 학습 내용',1,0,0,0,'2025-11-26 13:12:18','2025-11-26 13:12:18',0),(145,'dev_user1','MySQL JOIN 완전정복','SQL JOIN 예제와 실습',3,0,0,0,'2025-11-26 13:12:22','2025-11-26 13:12:22',0),(146,'user1','Docker로 Django 배포하기','Dockerfile compose Django 배포',2,1,0,0,'2025-11-26 13:12:26','2025-11-28 14:25:06',0),(147,'dev_user1','TensorFlow 기본 모델 구성','tensorflow mnist 모델 실습',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(148,'user1','Spring Boot REST API 만들기','Spring Boot + JPA로 API 구성',2,1,0,0,'2025-11-26 13:12:47','2025-11-28 14:25:03',0),(149,'dev_user1','FastAPI 속도 빠른 이유','FastAPI ASGI 구조 설명',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(150,'user1','Vue.js 반응형 데이터 공부','Vue computed watch 실습',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(151,'dev_user1','AI 데이터 전처리','pandas numpy 전처리 기법',3,1,0,0,'2025-11-26 13:12:47','2025-11-26 13:16:11',0),(152,'user1','Next.js SSR SEO 원리','Next.js SSR SEO 장점 분석',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(153,'dev_user1','Node.js JWT 로그인 구현','Express JWT 인증 처리',2,1,0,0,'2025-11-26 13:12:47','2025-11-28 14:25:01',0),(154,'user1','PostgreSQL 튜닝 기초','PostgreSQL 인덱스 전략',3,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(155,'dev_user1','AWS EC2 Flask 배포','EC2 + Gunicorn + Nginx 구성',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(156,'user1','Kubernetes 개념 정리','k8s pod deployment service',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(157,'dev_user1','Java HashMap 분석','Java HashMap 시간복잡도',3,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(158,'user1','MongoDB Document 설계','MongoDB 데이터 모델링 전략',3,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(159,'dev_user1','Flask Blueprint 구조화','Flask 모듈화 방법',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(160,'user1','React Hooks 정리','React useMemo useCallback 사용법',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(161,'dev_user1','Machine Learning SVM 설명','SVM 원리와 매개변수 설명',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(162,'user1','Oracle SQL 함수 정리','Oracle 내장 함수 설명',3,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(163,'dev_user1','Git 브랜치 전략 비교','Git-flow trunk-flow 비교',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(164,'user1','CSS Flex/Grid 정리','flexbox grid layout 설명',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(165,'dev_user1','Python Pandas 데이터 분석','pandas groupby merge 실습',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(166,'user1','Kubernetes 운영 팁','k8s 이미지 최적화 전략',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(167,'dev_user1','AI 모델 배포 전략','FastAPI Docker 기반 서빙 구조',1,0,0,0,'2025-11-26 13:12:47','2025-11-26 13:12:47',0),(168,'dev_user1','TensorFlow 기본 모델 구성','tensorflow mnist 모델 실습',1,0,0,0,'2025-11-26 13:13:00','2025-11-26 13:13:00',0),(169,'user1','Spring Boot REST API 만들기','Spring Boot + JPA로 API 구성',2,1,0,0,'2025-11-26 13:13:05','2025-11-28 14:25:00',0),(170,'dev_user1','FastAPI 속도 빠른 이유','FastAPI ASGI 구조 설명',1,0,0,0,'2025-11-26 13:13:11','2025-11-26 13:13:11',0),(171,'user1','Vue.js 반응형 데이터 공부','Vue computed watch 실습',1,0,0,0,'2025-11-26 13:13:15','2025-11-26 13:13:15',0),(172,'dev_user1','AI 데이터 전처리','pandas numpy 전처리 기법',3,12,0,0,'2025-11-26 13:13:23','2025-11-28 14:25:22',0),(173,'user1','Next.js SSR SEO 원리','Next.js SSR SEO 장점 분석',1,0,0,0,'2025-11-26 13:13:28','2025-11-26 13:13:28',0),(174,'dev_user1','Node.js JWT 로그인 구현','Express JWT 인증 처리',2,1,0,0,'2025-11-26 13:13:34','2025-11-28 14:24:58',0),(175,'user1','PostgreSQL 튜닝 기초','PostgreSQL 인덱스 전략',3,1,0,0,'2025-11-26 13:13:43','2025-11-28 14:25:17',0),(176,'dev_user1','AWS EC2 Flask 배포','EC2 + Gunicorn + Nginx 구성',1,0,0,0,'2025-11-26 13:13:50','2025-11-26 13:13:50',0),(177,'user1','Kubernetes 개념 정리','k8s pod deployment service',1,0,0,0,'2025-11-26 13:13:55','2025-11-26 13:13:55',0),(178,'dev_user1','Java HashMap 분석','Java HashMap 시간복잡도',3,1,0,0,'2025-11-26 13:14:01','2025-11-28 14:25:15',0),(179,'user1','MongoDB Document 설계','MongoDB 데이터 모델링 전략',3,2,0,0,'2025-11-26 13:14:05','2025-11-28 14:25:13',0),(180,'dev_user1','Flask Blueprint 구조화','Flask 모듈화 방법',1,0,0,0,'2025-11-26 13:14:09','2025-11-26 13:14:09',0),(181,'user1','React Hooks 정리','React useMemo useCallback 사용법',1,0,0,0,'2025-11-26 13:14:13','2025-11-26 13:14:13',0),(182,'dev_user1','Machine Learning SVM 설명','SVM 원리와 매개변수 설명',1,0,0,0,'2025-11-26 13:14:17','2025-11-26 13:14:17',0),(183,'dev_user1','Machine Learning SVM 설명','SVM 원리와 매개변수 설명',1,1,0,0,'2025-11-26 13:14:18','2025-11-26 13:15:14',0),(184,'user1','Oracle SQL 함수 정리','Oracle 내장 함수 설명',3,1,0,0,'2025-11-26 13:14:25','2025-11-28 14:25:11',0),(185,'dev_user1','Git 브랜치 전략 비교','Git-flow trunk-flow 비교',1,0,0,0,'2025-11-26 13:14:29','2025-11-26 13:14:29',0),(186,'user1','CSS Flex/Grid 정리','flexbox grid layout 설명',1,0,0,0,'2025-11-26 13:14:33','2025-11-26 13:14:33',0),(187,'dev_user1','Python Pandas 데이터 분석','pandas groupby merge 실습',1,2,0,0,'2025-11-26 13:14:37','2025-11-26 14:40:25',0),(188,'user1','Kubernetes 운영 팁','k8s 이미지 최적화 전략',1,7,0,0,'2025-11-26 13:14:41','2025-11-26 15:40:47',0),(189,'dev_user1','AI 모델 배포 전략','FastAPI Docker 기반 서빙 구조',1,7,1,0,'2025-11-26 13:14:48','2025-11-27 13:07:15',0),(190,'1','1123','123',1,1,0,0,'2025-11-27 09:56:45','2025-11-27 09:57:02',1),(191,'1','123','123',1,1,1,0,'2025-11-27 10:00:42','2025-11-27 10:02:07',1),(192,'1','test123','test1234',2,4,1,0,'2025-11-27 10:02:36','2025-11-28 14:24:57',0),(193,'1','asdf','asdf',1,1,0,0,'2025-11-27 10:03:57','2025-11-27 12:00:49',0),(194,'1','ㅎㅎㅎ','ㅅㄷㄴㅅ',3,0,0,0,'2025-11-27 10:20:39','2025-11-27 10:24:45',1),(195,'1','파이썬 어렵쌈','마이 어렵쌈',2,0,0,0,'2025-11-27 10:25:54','2025-11-27 10:27:01',1),(196,'1','(수정) 에이작스 어렵','마이 어렵 ㅎㅎㅎㅎㅎㅎㅎㅎㅎ',3,5,0,0,'2025-11-27 10:28:02','2025-11-27 12:02:50',0),(197,'1','','',1,0,0,0,'2025-11-27 10:29:27','2025-11-27 10:29:33',1),(198,'1','ㅇ','ㅇ',1,0,0,0,'2025-11-27 10:31:41','2025-11-27 10:31:41',1),(199,'1','ㅇㅇㅇ','ㅇㅇㅇ',2,0,0,0,'2025-11-27 10:33:27','2025-11-27 10:33:28',1),(200,'1','1','1',9,0,0,0,'2025-11-27 12:03:11','2025-11-27 12:03:17',1),(201,'1','ㅎㅎㅎㅎ','ㅎㅎㅎ',9,1,0,0,'2025-11-27 12:09:10','2025-11-27 14:20:52',0),(202,'1','고옹지이','ㅎㅎ',4,2,0,0,'2025-11-27 12:18:21','2025-11-27 12:46:23',0),(203,'1','ㅁㄴㅇㅎ','ㅁㄴㅇㅎㅁㄴㅇㅎ',1,1,0,0,'2025-11-27 13:01:43','2025-11-27 14:20:50',0),(204,'1','ㅓㅓㅓ','ㅓㅓㅓ',1,0,0,0,'2025-11-27 15:26:17','2025-11-27 15:26:17',0);
/*!40000 ALTER TABLE `board` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `board_view_log`
--

DROP TABLE IF EXISTS `board_view_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `board_view_log` (
  `log_id` int NOT NULL AUTO_INCREMENT COMMENT '게시글 조회 로그 고유번호',
  `user_id` varchar(50) NOT NULL COMMENT '조회한 사용자 아이디 (user.id 참조)',
  `board_no` int NOT NULL COMMENT '조회한 게시글 번호 (board.board_no 참조)',
  `viewed_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '조회 일시',
  PRIMARY KEY (`log_id`),
  KEY `idx_view_user_id` (`user_id`),
  KEY `idx_view_board_no` (`board_no`),
  CONSTRAINT `fk_view_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_view_user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=76 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `board_view_log`
--

LOCK TABLES `board_view_log` WRITE;
/*!40000 ALTER TABLE `board_view_log` DISABLE KEYS */;
INSERT INTO `board_view_log` VALUES (1,'1',142,'2025-11-26 13:01:45'),(2,'1',140,'2025-11-26 13:01:48'),(3,'1',139,'2025-11-26 13:01:51'),(4,'1',135,'2025-11-26 13:01:53'),(5,'1',133,'2025-11-26 13:01:57'),(6,'1',132,'2025-11-26 13:01:58'),(7,'1',97,'2025-11-26 13:02:30'),(8,'1',117,'2025-11-26 13:02:44'),(9,'1',109,'2025-11-26 13:02:46'),(10,'1',189,'2025-11-26 13:15:04'),(11,'1',188,'2025-11-26 13:15:06'),(12,'1',187,'2025-11-26 13:15:09'),(13,'1',183,'2025-11-26 13:15:14'),(14,'1',172,'2025-11-26 13:15:22'),(15,'1',151,'2025-11-26 13:16:11'),(16,'1',187,'2025-11-26 14:40:25'),(17,'1',179,'2025-11-26 14:40:45'),(18,'1',189,'2025-11-26 15:39:55'),(19,'1',1,'2025-11-26 15:40:04'),(20,'1',2,'2025-11-26 15:40:08'),(21,'1',4,'2025-11-26 15:40:11'),(22,'1',7,'2025-11-26 15:40:18'),(23,'1',188,'2025-11-26 15:40:27'),(24,'1',188,'2025-11-26 15:40:29'),(25,'1',188,'2025-11-26 15:40:43'),(26,'1',188,'2025-11-26 15:40:43'),(27,'1',188,'2025-11-26 15:40:44'),(28,'1',188,'2025-11-26 15:40:47'),(29,'1',190,'2025-11-27 09:56:44'),(30,'1',191,'2025-11-27 10:00:46'),(31,'1',192,'2025-11-27 10:02:57'),(32,'1',196,'2025-11-27 11:44:05'),(33,'1',192,'2025-11-27 11:44:11'),(34,'1',196,'2025-11-27 11:44:18'),(35,'1',196,'2025-11-27 11:44:19'),(36,'1',196,'2025-11-27 11:44:20'),(37,'1',196,'2025-11-27 11:49:13'),(38,'1',193,'2025-11-27 12:00:36'),(39,'1',202,'2025-11-27 12:46:19'),(40,'1',202,'2025-11-27 12:46:23'),(41,'1',10,'2025-11-27 12:59:50'),(42,'1',1,'2025-11-27 13:00:51'),(43,'1',50,'2025-11-27 13:02:56'),(44,'1',30,'2025-11-27 13:03:07'),(45,'1',20,'2025-11-27 13:03:15'),(46,'1',21,'2025-11-27 13:03:28'),(47,'1',192,'2025-11-27 13:05:36'),(48,'1',189,'2025-11-27 13:07:15'),(49,'1',10,'2025-11-27 14:00:59'),(50,'user1',203,'2025-11-27 14:20:50'),(51,'user1',201,'2025-11-27 14:20:52'),(52,'user1',139,'2025-11-27 14:21:41'),(53,'1',1,'2025-11-27 14:45:59'),(54,'1',9,'2025-11-27 14:46:19'),(55,'1',192,'2025-11-28 14:24:57'),(56,'1',174,'2025-11-28 14:24:58'),(57,'1',169,'2025-11-28 14:25:00'),(58,'1',153,'2025-11-28 14:25:01'),(59,'1',148,'2025-11-28 14:25:03'),(60,'1',146,'2025-11-28 14:25:06'),(61,'1',184,'2025-11-28 14:25:11'),(62,'1',179,'2025-11-28 14:25:13'),(63,'1',178,'2025-11-28 14:25:15'),(64,'1',175,'2025-11-28 14:25:17'),(65,'1',172,'2025-11-28 14:25:18'),(66,'1',172,'2025-11-28 14:25:19'),(67,'1',172,'2025-11-28 14:25:20'),(68,'1',172,'2025-11-28 14:25:20'),(69,'1',172,'2025-11-28 14:25:20'),(70,'1',172,'2025-11-28 14:25:21'),(71,'1',172,'2025-11-28 14:25:21'),(72,'1',172,'2025-11-28 14:25:21'),(73,'1',172,'2025-11-28 14:25:22'),(74,'1',172,'2025-11-28 14:25:22'),(75,'1',172,'2025-11-28 14:25:22');
/*!40000 ALTER TABLE `board_view_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chat`
--

DROP TABLE IF EXISTS `chat`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chat` (
  `chat_no` int NOT NULL AUTO_INCREMENT COMMENT '채팅 고유번호',
  `id` varchar(50) NOT NULL COMMENT '채팅 작성자 아이디 (user.id 참조)',
  `chat_content` text NOT NULL COMMENT '채팅 내용',
  `chat_created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '작성일시',
  PRIMARY KEY (`chat_no`),
  KEY `fk_chat_user_id` (`id`),
  CONSTRAINT `fk_chat_user_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chat`
--

LOCK TABLES `chat` WRITE;
/*!40000 ALTER TABLE `chat` DISABLE KEYS */;
INSERT INTO `chat` VALUES (1,'1','되나?','2025-11-12 13:53:12'),(2,'1','인클루드 시험','2025-11-12 13:53:15'),(3,'1','2','2025-11-26 09:15:19'),(4,'1','s','2025-11-26 09:19:31'),(5,'1','ㅗ','2025-11-26 09:19:35'),(6,'1','asdfasdf','2025-11-26 09:20:17'),(7,'1','ㅅㅂ','2025-11-26 09:21:19'),(8,'1','ㅎㅇ','2025-11-26 09:21:36'),(9,'user1','zz','2025-11-26 09:23:37'),(10,'user1','ㅋㅋ','2025-11-26 09:23:38'),(11,'1','ㅅㅂ','2025-11-26 09:23:43'),(12,'1','ㅇㄴㅇㅇ','2025-11-26 09:23:46'),(13,'1','ㅎㅇ','2025-11-26 09:27:39'),(14,'user1','tq','2025-11-26 09:27:40'),(15,'1','된다','2025-11-26 09:27:42'),(16,'user1','싸비','2025-11-26 09:27:42'),(17,'1','싸비','2025-11-26 09:27:43'),(18,'user1','ㅋㅋ','2025-11-26 09:29:14'),(19,'user1','똑 발오 핫암','2025-11-26 09:29:21'),(20,'user1','ㅋㅋ','2025-11-26 09:29:23'),(21,'1','Qkzb','2025-11-26 09:29:38'),(22,'1','빠큐','2025-11-26 09:29:40'),(23,'user1','빠크유?','2025-11-26 09:29:45'),(24,'1','얍~','2025-11-26 09:29:48'),(25,'1','ㅁㄴㅇㄹ','2025-11-26 09:29:54'),(26,'1','ㅁㄴㅇㄹ','2025-11-26 09:29:55'),(27,'user1','ㅋㅋ','2025-11-26 09:29:56'),(28,'1','ㅁㄴㅇ','2025-11-26 09:29:56'),(29,'1','ㄻ','2025-11-26 09:29:56'),(30,'user1','실헝','2025-11-26 09:29:57'),(31,'1','ㄴㅇㄹㅇㄹ','2025-11-26 09:29:57'),(32,'1','ㅁㄹ','2025-11-26 09:29:58'),(33,'1','ㅁㄴㅁㄴ','2025-11-26 09:29:59'),(34,'1','ㅇㄻ','2025-11-26 09:29:59'),(35,'user1','싫다고','2025-11-26 09:29:59'),(36,'1','ㄴㅇㄹ','2025-11-26 09:30:00'),(37,'1','ㅁㄴㅇ','2025-11-26 09:30:01'),(38,'1','ㄻㄴ','2025-11-26 09:30:01'),(39,'1','ㅇㄻ','2025-11-26 09:30:02'),(40,'1','ㄴㅇㄹ','2025-11-26 09:30:02'),(41,'1','ㅁㄴㅇㄹ','2025-11-26 09:30:02'),(42,'1','ㅁㄴ','2025-11-26 09:30:02'),(43,'1','ㅇㄻㄴ','2025-11-26 09:30:02'),(44,'1','ㅇㄹ','2025-11-26 09:30:02'),(45,'1','ㅁㄴㅇㄹ','2025-11-26 09:30:02'),(46,'1','ㅁㄴ','2025-11-26 09:30:02'),(47,'1','ㅇㄻ','2025-11-26 09:30:02'),(48,'1','ㄴㅇㄹ','2025-11-26 09:30:02'),(49,'1','ㅁㄴㅇ','2025-11-26 09:30:02'),(50,'1','ㄻㄴ','2025-11-26 09:30:03'),(51,'1','ㅇㄻ','2025-11-26 09:30:03'),(52,'1','ㄴㅇㄹ','2025-11-26 09:30:03'),(53,'1','ㅁㄴㅇㄹ','2025-11-26 09:30:03'),(54,'1','ㅁㄴ','2025-11-26 09:30:03'),(55,'1','ㅇㄻㄴ','2025-11-26 09:30:03'),(56,'1','ㅇㄹ','2025-11-26 09:30:03'),(57,'user1','ㅋㅋ','2025-11-26 09:30:09'),(58,'user1','ㅋㅋ','2025-11-26 09:30:11'),(59,'user1','ㅋㅋ','2025-11-26 09:30:12'),(60,'user1','ㅋ','2025-11-26 09:30:13'),(61,'user1','ㅋ','2025-11-26 09:30:13'),(62,'user1','ㅋ','2025-11-26 09:30:13'),(63,'user1','ㅋ','2025-11-26 09:30:13'),(64,'user1','ㅋ','2025-11-26 09:30:13'),(65,'user1','ㅋ','2025-11-26 09:30:13'),(66,'user1','ㅋ','2025-11-26 09:30:14'),(67,'user1','ㅋ','2025-11-26 09:30:14'),(68,'user1','ㅋ','2025-11-26 09:30:14'),(69,'user1','ㅋㅋㅋ','2025-11-26 09:30:21'),(70,'user1','ㅋ','2025-11-26 09:30:22'),(71,'user1','ㅋ','2025-11-26 09:30:22'),(72,'user1','ㅋㅋ','2025-11-26 09:30:22'),(73,'user1','ㅋ','2025-11-26 09:30:23'),(74,'1','ㅎㅇ','2025-11-26 09:42:44'),(75,'1','2321','2025-11-26 12:51:02'),(76,'user026','하염','2025-11-26 15:43:31'),(77,'user026','첫 출근입니당','2025-11-26 15:43:36'),(78,'user026','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2025-11-26 15:43:43'),(79,'user026','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2025-11-26 15:43:50'),(80,'user026','너무 느린데?','2025-11-26 15:43:55'),(81,'1','ㅋㅋ','2025-11-26 15:48:33'),(82,'1','님아','2025-11-26 15:49:04'),(83,'1','잘 좀 해보셈','2025-11-26 15:49:07'),(84,'1','ㅋㅋ','2025-11-26 15:49:08'),(85,'1','겨우 이정도?','2025-11-26 15:49:12'),(86,'1','ㅋㅋ','2025-11-26 15:49:13'),(87,'1','ㅋㅋㅋㅋ','2025-11-26 15:49:15'),(88,'user026','ㅅㅂ','2025-11-26 15:49:20'),(89,'user026','오류나 내지마세요','2025-11-26 15:49:23'),(90,'user026','어우','2025-11-26 15:53:26'),(91,'user026','이게 훨배낫다','2025-11-26 15:53:28'),(92,'user1','qhwk','2025-11-26 16:03:49'),(93,'user1','보자','2025-11-26 16:03:50'),(94,'user1','보자','2025-11-26 16:03:51'),(95,'user1','보오자','2025-11-26 16:03:54'),(96,'1','ㅋㅋ','2025-11-26 16:03:55'),(97,'user1','ㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2025-11-26 16:03:56'),(98,'1','보자보자','2025-11-26 16:03:58'),(99,'1','어서보자','2025-11-26 16:03:59'),(100,'1','벗어보자','2025-11-26 16:04:01'),(101,'user1','시바','2025-11-26 16:04:02'),(102,'user1','\\너','2025-11-26 16:04:02'),(103,'1','?','2025-11-26 16:04:05'),(104,'user1','`1대1대화 들어와','2025-11-26 16:04:06'),(105,'1','시바?','2025-11-26 16:04:07'),(106,'user1','ㅎㅇ','2025-11-26 16:08:21'),(107,'1','ㅁㄴㅇㅁㄴㅇ','2025-11-26 16:08:22'),(108,'1','123124','2025-11-26 16:26:51'),(109,'1','ㅎㅇ','2025-11-27 09:29:47'),(110,'1','ㅎㅇ','2025-11-27 09:29:56'),(111,'user1','ㅋ','2025-11-27 09:29:57'),(112,'user1','님아 잘 됨?','2025-11-27 10:03:55'),(113,'1','zzz','2025-11-27 10:04:01'),(114,'1','fdfdfd','2025-11-28 15:01:13');
/*!40000 ALTER TABLE `chat` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment_answer`
--

DROP TABLE IF EXISTS `comment_answer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment_answer` (
  `comment_answer_no` int NOT NULL AUTO_INCREMENT COMMENT '댓글답안 고유번호',
  `board_no` int NOT NULL COMMENT '게시글 고유번호 (board.board_no 참조)',
  `id` varchar(50) NOT NULL COMMENT '작성자 아이디 (user.id 참조)',
  `comment_answer_content` text NOT NULL COMMENT '댓글답안내용',
  `comment_like_count` int NOT NULL DEFAULT '0' COMMENT '댓글 추천수',
  `comment_dislike_count` int NOT NULL DEFAULT '0' COMMENT '댓글 비추천수',
  `comment_answer_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '댓글답안작성일시',
  `comment_answer_updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '댓글답안 수정일시',
  `comment_answer_type` int NOT NULL COMMENT '1: 댓글 2:답안',
  `answer_accepted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '답안채택여부',
  PRIMARY KEY (`comment_answer_no`),
  KEY `fk_ca_board_no` (`board_no`),
  KEY `fk_ca_user_id` (`id`),
  CONSTRAINT `fk_ca_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`),
  CONSTRAINT `fk_ca_user_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=136 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment_answer`
--

LOCK TABLES `comment_answer` WRITE;
/*!40000 ALTER TABLE `comment_answer` DISABLE KEYS */;
INSERT INTO `comment_answer` VALUES (1,1,'dev_user2','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.123',7,2,'2025-10-15 11:40:29','2025-11-27 14:46:01',1,0),(2,1,'dev_user1','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.asdfs',8,1,'2025-10-15 11:40:29','2025-11-27 13:00:55',1,0),(3,1,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-15)',0,0,'2025-10-15 11:40:29','2025-10-24 08:54:31',2,1),(4,4,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.4)',2,0,'2025-10-16 09:12:00','2025-10-24 08:54:31',1,0),(5,4,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-16)',1,0,'2025-10-16 09:13:12','2025-10-24 08:54:31',2,1),(6,5,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.6)',0,0,'2025-10-16 09:15:21','2025-10-24 08:54:31',1,0),(7,9,'dev_user4','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.',3,0,'2025-10-16 09:17:00','2025-10-24 08:54:31',1,0),(8,9,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-16)',1,0,'2025-10-16 09:17:43','2025-10-24 08:54:31',2,1),(9,13,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.9)',0,0,'2025-10-16 09:19:25','2025-10-24 08:54:31',1,0),(10,13,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.10)',0,0,'2025-10-16 09:20:10','2025-10-24 08:54:31',1,0),(11,13,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-16)',0,0,'2025-10-16 09:21:02','2025-10-24 08:54:31',2,1),(12,18,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.12)',2,0,'2025-10-16 09:23:30','2025-10-24 08:54:31',1,0),(13,18,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-16)',0,0,'2025-10-16 09:24:15','2025-10-24 08:54:31',2,1),(14,2,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.14)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(15,3,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.15)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(16,6,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.16)',2,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(17,7,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(18,8,'dev_user4','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.',3,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(19,10,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.19)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(20,11,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.20)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(21,12,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',2,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(22,14,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.22)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(23,15,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.23)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(24,16,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.24)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(25,17,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',2,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(26,19,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.26)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(27,20,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.27)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(28,21,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.28)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(29,22,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(30,23,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.30)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(31,24,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.31)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(32,25,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.32)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(33,26,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.33)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(34,27,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(35,28,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.35)',2,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(36,29,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.36)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(37,30,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(38,31,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.38)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(39,32,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.39)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(40,33,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(41,34,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.41)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(42,35,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.42)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(43,36,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(44,37,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.44)',2,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(45,38,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.45)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(46,39,'dev_user3','[GENERAL_COMMENT] Continuing the discussion. (No.46)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(47,40,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',1,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(48,41,'dev_user4','[GENERAL_COMMENT] Continuing the discussion. (No.48)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(49,42,'dev_user2','[GENERAL_COMMENT] Continuing the discussion. (No.49)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(50,43,'admin_user','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-17)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,1),(52,2,'dev_user1','[GENERAL_COMMENT] Continuing the discussion. (No.52)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',1,0),(53,2,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-17 09:01:40','2025-10-24 08:54:31',2,0),(54,1,'1','[ACCEPTED_SOLUTION] This is the best solution for the question. (Date: 2025-10-15)',0,0,'2025-10-15 11:40:29','2025-10-24 08:54:31',2,1),(55,104,'1','[GENERAL_COMMENT] Continuing the discussion. (No.55)',0,0,'2025-10-21 14:07:20','2025-10-24 08:54:31',1,0),(56,104,'1','[GENERAL_COMMENT] Continuing the discussion. (No.56)',0,0,'2025-10-21 14:21:26','2025-10-24 08:54:31',1,0),(63,107,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)123',0,0,'2025-10-21 15:41:21','2025-11-24 13:26:04',2,0),(72,107,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-21 16:26:32','2025-10-24 08:54:31',2,0),(73,107,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-21 16:27:53','2025-10-24 08:54:31',2,0),(75,107,'1','[GENERAL_COMMENT] Continuing the discussion. (No.75)',0,0,'2025-10-21 16:28:45','2025-10-24 08:54:31',1,0),(76,111,'1','[GENERAL_COMMENT] Continuing the discussion. (No.76)',0,0,'2025-10-21 17:06:40','2025-10-24 08:54:31',1,0),(77,111,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-21 17:06:48','2025-10-24 08:54:31',2,0),(78,116,'1','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.',4,4,'2025-10-21 18:24:13','2025-10-24 08:54:31',1,0),(79,116,'1','[GENERAL_COMMENT] Continuing the discussion. (No.79)',0,0,'2025-10-21 18:24:37','2025-10-24 08:54:31',1,0),(80,116,'1','[GENERAL_COMMENT] Continuing the discussion. (No.80)',1,1,'2025-10-22 08:39:31','2025-10-24 08:54:31',1,0),(81,117,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)ㅇㅇㅇ',0,0,'2025-10-22 08:40:02','2025-11-24 13:21:29',2,0),(82,117,'1','[GENERAL_COMMENT] Continuing the discussion. (No.82)ㅁㄴㅇㄹ',1,0,'2025-10-22 08:40:08','2025-11-24 13:21:38',1,0),(83,124,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 10:28:04','2025-10-24 08:54:31',2,0),(84,124,'1','[GENERAL_COMMENT] Continuing the discussion. (No.84)',0,0,'2025-10-22 10:28:08','2025-10-24 08:54:31',1,0),(85,125,'1','[GENERAL_COMMENT] Continuing the discussion. (No.85)',0,0,'2025-10-22 10:28:27','2025-10-24 08:54:31',1,0),(86,130,'1','[GENERAL_COMMENT] Continuing the discussion. (No.86)',1,1,'2025-10-22 12:36:26','2025-10-24 08:54:31',1,0),(87,130,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 12:46:18','2025-11-24 16:09:18',2,1),(89,131,'1','[GENERAL_COMMENT] Continuing the discussion. (No.89)',1,0,'2025-10-22 12:53:05','2025-10-24 08:54:31',1,0),(90,131,'user1','[GENERAL_COMMENT] Continuing the discussion. (No.90)',1,0,'2025-10-22 13:06:26','2025-10-24 08:54:31',1,0),(91,131,'user1','[GENERAL_COMMENT] Continuing the discussion. (No.91)',1,1,'2025-10-22 13:06:34','2025-10-24 08:54:31',1,0),(92,133,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 13:27:00','2025-10-24 08:54:31',2,0),(93,133,'1','HIGHLY_LIKED_COMMENT: Great tip! I agree with this.',3,2,'2025-10-22 13:27:05','2025-10-24 08:54:31',1,0),(94,132,'1','[GENERAL_COMMENT] Continuing the discussion. (No.94)',1,1,'2025-10-22 14:52:57','2025-10-24 08:54:31',1,0),(95,134,'1','[GENERAL_COMMENT] Continuing the discussion. (No.95)',0,0,'2025-10-22 14:55:26','2025-10-24 08:54:31',1,0),(96,133,'1','[GENERAL_COMMENT] Continuing the discussion. (No.96)',0,0,'2025-10-22 14:55:32','2025-10-24 08:54:31',1,0),(97,133,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 14:55:39','2025-10-24 08:54:31',2,0),(98,131,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 14:55:44','2025-10-24 08:54:31',2,0),(99,130,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-22 16:21:21','2025-10-24 08:54:31',2,0),(100,130,'1','[GENERAL_COMMENT] Continuing the discussion. (No.100)',0,0,'2025-10-22 16:21:34','2025-10-24 08:54:31',1,0),(101,133,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-23 09:54:28','2025-10-24 08:54:31',2,0),(102,133,'1','[GENERAL_COMMENT] Continuing the discussion. (No.102)',0,0,'2025-10-23 09:54:33','2025-10-24 08:54:31',1,0),(104,102,'123','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-23 11:34:17','2025-11-24 14:13:53',2,0),(105,142,'123','[GENERAL_COMMENT] Continuing the discussion. (No.105)',2,1,'2025-10-23 11:34:27','2025-11-26 15:00:33',1,0),(106,102,'1','[GENERAL_COMMENT] Continuing the discussion. (No.106)',0,0,'2025-10-23 16:54:42','2025-11-24 14:14:18',1,0),(107,131,'1','[ALTERNATIVE_ANSWER] Check this alternative approach. (Likes: 0)',0,0,'2025-10-23 16:54:54','2025-10-24 08:54:31',2,0),(108,139,'aezen','카테고리 2의 답변입니다!',0,0,'2025-10-24 09:52:17','2025-11-24 16:09:07',2,1),(110,128,'1','asdasdfasdfasdf',0,0,'2025-10-24 12:46:27','2025-11-26 12:09:14',2,0),(111,128,'1','asdasfasdgf',0,0,'2025-10-24 12:46:34','2025-10-24 12:46:34',1,0),(112,142,'1','asdasd',1,1,'2025-10-24 14:26:53','2025-11-25 11:18:07',1,0),(113,139,'1','이렇게 풀면됩니다.',0,0,'2025-10-24 15:08:39','2025-11-24 16:09:07',2,0),(114,128,'1','testing',0,0,'2025-11-24 15:05:51','2025-11-24 15:05:51',1,0),(115,128,'1','testingggggg',0,0,'2025-11-24 15:06:06','2025-11-26 12:09:14',2,1),(116,140,'1','tetstststst',0,0,'2025-11-24 15:06:24','2025-11-24 15:06:24',1,0),(117,140,'1','tetetet',0,0,'2025-11-24 15:06:32','2025-11-24 15:06:32',1,0),(118,139,'1','asdf',0,0,'2025-11-24 15:06:46','2025-11-24 15:06:46',2,0),(119,139,'1','asdxcvccc',0,0,'2025-11-24 15:06:51','2025-11-24 15:06:51',1,0),(120,142,'1','ㅎㅎ',1,1,'2025-11-24 15:09:27','2025-11-25 11:18:07',1,0),(121,140,'1','ㅎㅎㅎ',0,0,'2025-11-24 15:10:22','2025-11-24 15:10:22',1,0),(122,139,'1','ㅎㅎㅎ',0,0,'2025-11-24 15:11:58','2025-11-24 15:11:58',1,0),(123,139,'1','ㄷㄷㄷ',0,0,'2025-11-24 15:12:01','2025-11-24 15:12:01',1,0),(124,128,'1','ㅅㄷㄴㅅㄴㅅ',0,0,'2025-11-24 15:12:17','2025-11-24 15:12:17',1,0),(125,127,'1','ㄷㄱ',0,0,'2025-11-24 15:12:25','2025-11-24 15:12:25',1,0),(126,127,'1','answer',0,0,'2025-11-24 15:12:36','2025-11-24 15:12:36',2,0),(127,140,'1','ㅁㄴㅇㄻㄴㅇㄻㄴㄹㅇ',0,0,'2025-11-24 16:13:05','2025-11-24 16:13:05',1,0),(128,140,'1','ㅎㅎ',1,0,'2025-11-25 09:58:30','2025-11-25 09:58:33',1,0),(129,192,'1','gg',0,0,'2025-11-27 10:02:50','2025-11-27 10:02:54',2,1),(130,192,'1','ggggg',1,0,'2025-11-27 10:02:59','2025-11-27 10:03:02',1,0),(131,10,'1','ㅎㅎㅇㅇ',1,0,'2025-11-27 12:59:53','2025-11-27 13:00:01',1,0),(132,4,'1','ㅁㄴㅇㅎ',0,0,'2025-11-27 13:01:16','2025-11-27 13:01:16',2,0),(133,184,'1','ㅋㅋㅋㅋㅋㅋ',0,0,'2025-11-27 13:06:06','2025-11-27 13:06:06',2,0),(134,189,'1','ㅋㅋㅋ',0,0,'2025-11-27 13:07:16','2025-11-27 13:07:16',1,0),(135,9,'1','ㅎㅎㅎㅎ',0,0,'2025-11-27 14:46:13','2025-11-27 14:46:13',2,0);
/*!40000 ALTER TABLE `comment_answer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `file`
--

DROP TABLE IF EXISTS `file`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `file` (
  `file_no` int NOT NULL AUTO_INCREMENT COMMENT '파일고유번호',
  `logical_file_name` varchar(255) NOT NULL COMMENT '논리파일명',
  `physical_file_name` varchar(255) NOT NULL COMMENT '물리파일명',
  `file_size` bigint NOT NULL COMMENT '파일 크기 (Byte 단위)',
  `file_ext` varchar(10) NOT NULL COMMENT '파일 확장자',
  `board_no` int NOT NULL COMMENT '게시글 고유번호 (board.board_no 참조)',
  PRIMARY KEY (`file_no`),
  KEY `fk_file_board_no` (`board_no`),
  CONSTRAINT `fk_file_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `file`
--

LOCK TABLES `file` WRITE;
/*!40000 ALTER TABLE `file` DISABLE KEYS */;
INSERT INTO `file` VALUES (2,'react_project_source.zip','uuid_react_project.zip',512000,'zip',1),(3,'img1.jpg','uuid_img1.jpg',102400,'jpg',1),(4,'img1.jpg','uuid_img1.jpg',204800,'jpg',2),(5,'img2.jpg','uuid_img2.jpg',102400,'jpg',2),(6,'한글제목.png','37c67202-f963-41b0-92a6-1b6298a5bf5a.png',557056,'png',69),(7,'[채점프로그램] 오류 날 때.txt','2da30479-623d-4f46-b8b1-73b003bb9083.txt',400,'txt',70),(8,'[채점프로그램] 오류 날 때.txt','7afc9a1e-f7db-43eb-a320-220f0c4d63c7.txt',400,'txt',71),(9,'[채점프로그램] 오류 날 때.txt','b08e6f30-2159-4654-8dec-3e0f4d034477.txt',400,'txt',72),(10,'[채점프로그램] 오류 날 때.txt','10d67878-0e5c-4443-b3b0-4892b3277e87.txt',400,'txt',78),(11,'[채점프로그램] 오류 날 때.txt','34788e4b-44c1-4fdf-87cf-0860c71e919d.txt',400,'txt',83),(12,'[채점프로그램] 오류 날 때.txt','b777e889-8fdf-4c10-9cdc-a1b4cbbcf3e9.txt',400,'txt',105),(13,'[채점프로그램] 오류 날 때.txt','bc34621a-0207-41a0-b4da-cc1d1e8be7e5.txt',400,'txt',110),(14,'Capture001.png','0970a7d2-b3ba-4127-92cb-e607ed946ac5.png',556265,'png',111),(15,'phone2.jpg','c5b78fcc-90c3-482f-8197-bccbb8418c08.jpg',32768,'jpg',111),(16,'phone2.jpg','b08c7bf3-88ff-414e-9c1f-09ffe2faddaf.jpg',32768,'jpg',112),(17,'cat.png','a6f17b02-a768-4a12-8475-1f7e9883fe7e.png',56250,'png',113),(18,'한글제목.png','e6db678c-fffe-4072-b8eb-dfc0089dc9cd.png',557056,'png',114),(19,'cat.png','d6b98cda-3b20-4152-9ae8-73497ebfd85d.png',56250,'png',114),(20,'한글제목.png','cc9ff7f5-156e-4c94-ba36-2889a643f2f9.png',557056,'png',115),(21,'Capture0012 (2).png','777029c0-38ab-41d0-acbc-b12ed2baed3f.png',557056,'png',116),(22,'Capture001.png','adb15ec3-313b-46c5-ae92-133141d2dcc8.png',556265,'png',118),(23,'Capture001.png','d6bff928-2e5a-47ec-9e2d-0a9547e0a1b4.png',556265,'png',119),(24,'Capture001.png','3c1521f8-c5a3-4ab6-af95-c90341cc9c44.png',556265,'png',120),(25,'Capture001.png','3385d15a-c846-4f45-8a46-f5914c814cd4.png',556265,'png',121),(26,'Capture001.png','618e079f-7710-4f13-a55e-bb2970bfc732.png',556265,'png',122),(27,'Capture001.png','d79d1c41-c191-444b-857e-e135c7796f31.png',556265,'png',129),(28,'피드백.txt','e81b0320-ff38-44fc-8874-b94d07d2968d.txt',115,'txt',135),(29,'마이페이지.txt','3f269e33-24f5-4d1d-82ea-daa88c181766.txt',39991,'txt',137),(30,'root-context.txt','dab1177e-f824-4fb0-9895-20be6a737a62.txt',3252,'txt',139),(31,'우선순위.txt','e4d4c019-e2ef-4bb8-876f-04293d29f493.txt',235,'txt',140),(32,'b팀3.png','d35affe6-4525-4a8d-8742-35e76c54d2e7.png',2108171,'png',141),(33,'readme.txt','271e1efa90c04366a9179d41899aaf15.txt',4803,'txt',191),(34,'readme.txt','d5a1b41baf8d45a79434c0523b0e54a1.txt',4803,'txt',192),(35,'license.txt','a8219ed7dd774b4cbd66fcc906418f28.txt',1680,'txt',194),(36,'readme.txt','e4b12a7ff0a04bb39fd3eb7b41575b6f.txt',4803,'txt',194),(37,'unins000.dat','900200aeb93340f5ac136ec654593e38.dat',13467,'dat',194),(38,'changelog.txt','be004a0175ec4150838c5e04e1e59920.txt',53982,'txt',195),(39,'HxD.exe','046b7a4f39fd4a368525fa34f68106ad.exe',6888960,'exe',195),(42,'readme.txt','4c6f5fae39c2469982b91cd324f1bfb1.txt',4803,'txt',196),(43,'changelog.txt','4673575965f1407ab2597fa66eda7423.txt',53982,'txt',197),(44,'unins000.dat','02b02dc16e87482ca9fa6e1425af2fe6.dat',13467,'dat',197),(45,'license.txt','5c4c42240b1e4cde9bebbddee93242bc.txt',1680,'.txt',192),(46,'HxD.exe','acb8957dae054f59bacee18398c909fb.exe',6888960,'.exe',192),(49,'unins000.exe','cd0e4f4c8be0418c83376ddca6c5b5aa.exe',1199187,'.exe',193);
/*!40000 ALTER TABLE `file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `follow`
--

DROP TABLE IF EXISTS `follow`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `follow` (
  `following_id` varchar(50) NOT NULL COMMENT '팔로우를 건 사용자 ID (user.id 참조)',
  `followed_id` varchar(50) NOT NULL COMMENT '팔로우를 당한 사용자 ID (user.id 참조)',
  `follow_started_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '팔로우 시작일시',
  PRIMARY KEY (`following_id`,`followed_id`),
  KEY `fk_followed_id` (`followed_id`),
  CONSTRAINT `fk_followed_id` FOREIGN KEY (`followed_id`) REFERENCES `user` (`id`),
  CONSTRAINT `fk_following_id` FOREIGN KEY (`following_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `follow`
--

LOCK TABLES `follow` WRITE;
/*!40000 ALTER TABLE `follow` DISABLE KEYS */;
INSERT INTO `follow` VALUES ('1','dev_user1','2025-11-26 14:44:11'),('1','dev_user2','2025-11-26 13:19:09'),('1','user001','2025-11-26 15:43:30'),('1','user002','2025-11-26 15:43:29'),('1','user003','2025-11-26 15:43:29'),('1','user004','2025-11-26 14:57:03'),('1','user005','2025-11-26 14:57:03'),('1','user006','2025-11-26 14:57:03'),('1','user007','2025-11-26 14:57:03'),('1','user008','2025-11-26 14:57:03'),('1','user009','2025-11-26 14:57:03'),('1','user010','2025-11-26 14:57:03'),('1','user011','2025-11-26 14:57:03'),('1','user012','2025-11-26 14:57:03'),('1','user013','2025-11-26 14:57:03'),('1','user014','2025-11-26 15:43:30'),('1','user015','2025-11-26 15:43:30'),('1','user016','2025-11-26 14:57:03'),('1','user017','2025-11-26 14:57:03'),('1','user018','2025-11-26 14:57:03'),('1','user019','2025-11-26 14:57:03'),('1','user020','2025-11-26 14:57:03'),('1','user021','2025-11-26 14:57:03'),('1','user022','2025-11-26 14:57:03'),('1','user023','2025-11-26 14:57:03'),('1','user024','2025-11-26 14:57:03'),('1','user025','2025-11-26 14:57:03'),('1','user026','2025-11-26 15:43:38'),('1','user027','2025-11-26 14:57:03'),('1','user028','2025-11-26 14:57:03'),('1','user029','2025-11-26 14:57:03'),('1','user030','2025-11-26 14:57:03'),('1','user1','2025-11-26 14:44:10'),('dev_user1','1','2025-10-15 11:40:29'),('dev_user2','1','2025-10-22 14:31:54'),('dev_user2','dev_user1','2025-10-15 11:40:29'),('dev_user3','dev_user1','2025-10-15 11:40:29'),('dev_user4','user026','2025-11-26 14:57:03'),('user001','1','2025-11-26 14:58:56'),('user002','1','2025-11-26 14:58:56'),('user003','1','2025-11-26 14:58:56'),('user004','1','2025-11-26 14:58:56'),('user005','1','2025-11-26 14:58:56'),('user006','1','2025-11-26 14:58:56'),('user007','1','2025-11-26 14:58:56'),('user008','1','2025-11-26 14:58:56'),('user009','1','2025-11-26 14:58:56'),('user010','1','2025-11-26 14:58:56'),('user011','1','2025-11-26 14:58:56'),('user012','1','2025-11-26 14:58:56'),('user013','1','2025-11-26 14:58:56'),('user014','1','2025-11-26 14:58:56'),('user015','1','2025-11-26 14:58:56'),('user016','1','2025-11-26 14:58:56'),('user017','1','2025-11-26 14:58:56'),('user018','1','2025-11-26 14:58:56'),('user019','1','2025-11-26 14:58:56'),('user020','1','2025-11-26 14:58:56'),('user021','1','2025-11-26 14:58:56'),('user022','1','2025-11-26 14:58:56'),('user023','1','2025-11-26 14:58:56'),('user024','1','2025-11-26 14:58:56'),('user025','1','2025-11-26 14:58:56'),('user026','1','2025-11-26 14:58:56'),('user027','1','2025-11-26 14:58:56'),('user028','1','2025-11-26 14:58:56'),('user029','1','2025-11-26 14:58:56'),('user030','1','2025-11-26 14:58:56'),('user1','1','2025-10-22 14:31:54');
/*!40000 ALTER TABLE `follow` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `item`
--

DROP TABLE IF EXISTS `item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `item` (
  `item_no` int NOT NULL AUTO_INCREMENT,
  `item_name` varchar(100) NOT NULL,
  `item_type` enum('icon','background','insignia') NOT NULL,
  `item_price` int NOT NULL DEFAULT '0',
  `item_img` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`item_no`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `item`
--

LOCK TABLES `item` WRITE;
/*!40000 ALTER TABLE `item` DISABLE KEYS */;
INSERT INTO `item` VALUES (1,'고양이 아이콘','icon',100,'icons/cat.png','2025-11-25 14:34:35'),(2,'아이돌 배경','background',500,'backgrounds/m.png','2025-11-25 14:34:35'),(3,'설산 배경','background',500,'backgrounds/snow.png','2025-11-25 14:34:35'),(4,'장카설유','background',500,'backgrounds/idol.png','2025-11-27 10:13:16');
/*!40000 ALTER TABLE `item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `message`
--

DROP TABLE IF EXISTS `message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `message` (
  `message_no` int NOT NULL AUTO_INCREMENT COMMENT '메시지 고유번호',
  `room_no` int NOT NULL COMMENT '대화방 고유번호 (message_room.room_no 참조)',
  `sender_id` varchar(50) NOT NULL COMMENT '보낸 사용자 ID (user.id 참조)',
  `receiver_id` varchar(50) NOT NULL COMMENT '받는 사용자 ID (user.id 참조)',
  `message_content` text NOT NULL COMMENT '메시지 내용',
  `message_sent_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '메시지 발송 일시',
  `message_received_at` datetime DEFAULT NULL COMMENT '메시지 서버 수신 일시 (선택적)',
  `read_at` datetime DEFAULT NULL COMMENT '메시지 조회 일시 (NULL이면 미확인)',
  `message_deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '메시지 삭제 여부',
  PRIMARY KEY (`message_no`),
  KEY `fk_msg_room_no` (`room_no`),
  KEY `fk_msg_sender` (`sender_id`),
  KEY `fk_msg_receiver` (`receiver_id`),
  CONSTRAINT `fk_msg_receiver` FOREIGN KEY (`receiver_id`) REFERENCES `user` (`id`),
  CONSTRAINT `fk_msg_room_no` FOREIGN KEY (`room_no`) REFERENCES `message_room` (`room_no`),
  CONSTRAINT `fk_msg_sender` FOREIGN KEY (`sender_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=98 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message`
--

LOCK TABLES `message` WRITE;
/*!40000 ALTER TABLE `message` DISABLE KEYS */;
INSERT INTO `message` VALUES (1,4,'dev_user1','dev_user2','안녕하세요! 쿼리 질문 드렸던 사람입니다.','2025-10-15 11:40:29',NULL,NULL,0),(2,1,'dev_user2','dev_user1','네, 답변 채택 감사합니다!','2025-10-15 11:40:29',NULL,NULL,0),(3,1,'dev_user1','1','안녕! 나 dev_user1이야 😄','2025-10-21 12:22:52',NULL,NULL,1),(4,1,'dev_user1','1','안녕! 나 dev_user1이야 😄','2025-10-21 12:24:45',NULL,NULL,1),(5,2,'1','dev_user1','ㅁㅁㅁㅁ','2025-10-21 12:29:32',NULL,NULL,1),(6,3,'1','dev_user2','ㅁㄴㅇㅁ','2025-10-21 14:00:37',NULL,NULL,0),(7,1,'1','dev_user2','a','2025-10-21 14:16:48',NULL,NULL,0),(8,3,'1','dev_user2','b','2025-10-21 14:22:56',NULL,NULL,0),(9,1,'1','dev_user1','ㅁㄴㅇㅁㄴ','2025-10-22 12:43:14',NULL,NULL,0),(10,1,'1','dev_user1','ㅁㄴㅇㄻㄴㅇㄹ','2025-10-22 12:43:16',NULL,NULL,0),(11,1,'1','dev_user1','ㅁㄴㅇㅎㅁㄴㅇㅎㅁㄴㅇㅎ','2025-10-22 12:43:20',NULL,NULL,0),(12,1,'1','dev_user1','ㅁㄴㅇ','2025-10-22 12:44:31',NULL,NULL,0),(13,1,'1','dev_user1','ㅁㄴㅇㅁㄴㅇ','2025-10-22 12:48:32',NULL,NULL,0),(14,1,'1','dev_user1','ㅎㅎㅎㅎㅎ','2025-10-22 12:48:35',NULL,NULL,0),(15,1,'1','dev_user1','ㅁㅁ','2025-10-22 12:50:09',NULL,NULL,0),(16,1,'1','dev_user1','ㅁㄴㅇㅁㄴㅇ','2025-10-22 12:50:12',NULL,NULL,0),(17,1,'1','dev_user1','ㅋㅌㅊㅋㅌㅊㅋㅌ','2025-10-22 12:50:17',NULL,NULL,0),(19,2,'1','user1','안녕 1! 테스트 메시지야 😊','2025-10-22 12:59:33',NULL,NULL,1),(20,2,'1','user1','안녕! 1이야 😄','2025-10-22 12:59:38',NULL,NULL,1),(21,2,'user1','1','안녕! 1이야 😄','2025-10-22 13:00:41',NULL,'2025-11-25 09:59:18',1),(22,2,'1','dev_user1','반갑습니다','2025-10-22 13:07:28',NULL,NULL,1),(23,2,'1','dev_user1','ㅁㄴㅇㄴㅁㅇ','2025-10-22 13:08:06',NULL,NULL,1),(24,2,'1','dev_user1','asdas','2025-10-22 14:16:56',NULL,NULL,1),(25,2,'1','dev_user1','ㅁㅁㅁㅁ','2025-10-22 14:53:40',NULL,NULL,1),(26,2,'1','dev_user1','asdasd','2025-10-23 13:29:38',NULL,NULL,1),(27,2,'1','dev_user1','asdasdasdf','2025-10-23 16:57:48',NULL,NULL,1),(28,2,'1','dev_user1','qwqwdwqd','2025-10-23 16:57:50',NULL,NULL,1),(29,2,'1','dev_user1','안녕하세요','2025-10-24 10:00:54',NULL,NULL,1),(33,6,'1','dev_user3','반갑습니다. ','2025-10-24 12:55:24',NULL,NULL,0),(34,6,'dev_user3','1','안녕하세요. ','2025-10-24 12:55:36',NULL,'2025-11-25 09:59:20',0),(35,2,'user1','1','반가워유','2025-10-24 12:57:12',NULL,'2025-11-25 09:59:18',1),(36,2,'1','dev_user1','gi?','2025-10-24 15:10:39',NULL,NULL,1),(37,2,'1','dev_user1','ㅋㅋ','2025-11-25 09:59:28',NULL,NULL,1),(38,2,'1','dev_user1','asddasd','2025-11-25 11:31:49',NULL,NULL,1),(39,2,'1','dev_user1','asdasd','2025-11-25 11:31:53',NULL,NULL,1),(40,6,'1','dev_user3','asdasd','2025-11-25 11:31:58',NULL,NULL,0),(41,6,'1','dev_user3','ㅁㅁㅁㅁ','2025-11-25 11:37:24',NULL,NULL,0),(42,6,'1','dev_user3','ㅋㅋㅋㅋ','2025-11-25 11:46:57',NULL,NULL,0),(43,2,'1','dev_user1','ㅋㅋㅋㅋ','2025-11-25 11:47:16',NULL,NULL,1),(44,2,'1','dev_user1','ㅋㅋㅋㅋ','2025-11-25 11:49:37',NULL,NULL,1),(45,2,'1','dev_user1','ㅁ','2025-11-25 11:49:46',NULL,NULL,1),(46,2,'1','dev_user1','ㅁㄴㅇ','2025-11-25 12:04:47',NULL,NULL,1),(47,6,'1','dev_user3','ㅁㄴㅇ','2025-11-25 12:11:01',NULL,NULL,0),(48,2,'1','dev_user1','ㅁㄴㅇ','2025-11-25 12:13:43',NULL,NULL,1),(49,2,'1','dev_user1','ㅁㅁ','2025-11-25 12:13:45',NULL,NULL,1),(50,2,'1','dev_user1','ㅋㅋㅋㅋㅋ','2025-11-25 12:13:48',NULL,NULL,1),(51,2,'1','dev_user1','ㅋㅋ','2025-11-26 11:08:59',NULL,NULL,1),(52,6,'1','dev_user3','ㅁㄴㅇ','2025-11-26 11:09:02',NULL,NULL,0),(53,6,'1','dev_user3','ㅁㅁ','2025-11-26 11:09:04',NULL,NULL,0),(54,3,'1','dev_user2','ㅋㅋㅋ','2025-11-26 11:09:09',NULL,NULL,0),(55,4,'1','user1','안녕하세요 1','2025-11-26 11:09:19',NULL,'2025-11-26 14:45:16',0),(56,4,'1','user1','zzzz','2025-11-26 14:44:28',NULL,'2025-11-26 14:45:16',0),(57,3,'1','dev_user2','ㅋㅋㅌㅊㅋㅌㅊ','2025-11-26 14:44:55',NULL,NULL,0),(58,4,'1','user1','야 씨발아','2025-11-26 14:45:03',NULL,'2025-11-26 14:45:16',0),(59,4,'user1','1','왜 이씨발아','2025-11-26 14:45:21',NULL,'2025-11-26 14:46:10',0),(60,4,'1','user1','ㄱㄱㄱㄱ','2025-11-26 14:46:19',NULL,'2025-11-26 14:46:23',0),(61,4,'user1','1','뭘 ㄱ?','2025-11-26 14:46:34',NULL,'2025-11-26 14:46:38',0),(62,4,'1','user1','ㅋㅋ','2025-11-26 15:58:59',NULL,'2025-11-26 15:59:33',0),(63,4,'user1','1','님 뭐허셈','2025-11-26 15:59:38',NULL,'2025-11-26 15:59:57',0),(64,4,'1','user1','뭔 상관','2025-11-26 16:00:01',NULL,'2025-11-26 16:07:24',0),(65,4,'user1','1','ㅎㅇ','2025-11-26 16:07:29',NULL,'2025-11-26 16:08:00',0),(66,4,'user1','1','진짜\n두지레래용','2025-11-26 16:07:55',NULL,'2025-11-26 16:08:00',0),(67,4,'1','user1','ㅁㄴㅇㅁㄴㅇ','2025-11-26 16:08:02',NULL,'2025-11-26 16:08:27',0),(68,4,'1','user1','씹;ㅏㄹ','2025-11-26 16:08:30',NULL,'2025-11-26 16:08:33',0),(69,4,'user1','1','zzz','2025-11-27 09:08:24',NULL,'2025-11-27 09:28:00',0),(70,4,'user1','user1','zz','2025-11-27 09:08:28',NULL,'2025-11-27 09:10:53',0),(71,4,'user1','1','zz','2025-11-27 09:08:56',NULL,'2025-11-27 09:28:00',0),(72,4,'1','user1','ㅋㅋㅋㅋ','2025-11-27 09:28:01',NULL,'2025-11-27 09:30:01',0),(73,4,'user1','1','ㅋㅋㅋㅋㅋㅋㅋ','2025-11-27 09:30:07',NULL,'2025-11-27 09:30:37',0),(74,4,'1','user1','빠큐','2025-11-27 09:30:09',NULL,'2025-11-27 09:35:54',0),(75,4,'user1','1','ㅋㅋㅋㅋ','2025-11-27 09:35:56',NULL,'2025-11-27 10:03:15',0),(76,4,'user1','1','ㅋㅋ','2025-11-27 09:38:08',NULL,'2025-11-27 10:03:15',0),(77,4,'user1','1','ㅋㅋㅋㅋ','2025-11-27 09:50:39',NULL,'2025-11-27 10:03:15',0),(78,4,'user1','1','ㅋㅋㅋㅋ','2025-11-27 09:51:54',NULL,'2025-11-27 10:03:15',0),(79,4,'user1','1','ㅋㅋㅋㅋㅋㅋ','2025-11-27 09:59:55',NULL,'2025-11-27 10:03:15',0),(80,4,'user1','1','ㅋㅋㅋㅋㅋ','2025-11-27 10:00:23',NULL,'2025-11-27 10:03:15',0),(81,4,'user1','1','ㅋㅋㅋㅋㅋ','2025-11-27 10:01:10',NULL,'2025-11-27 10:03:15',0),(82,4,'user1','1','ㅋㅋㅋ','2025-11-27 10:02:12',NULL,'2025-11-27 10:03:15',0),(83,4,'user1','1','ㅋㅋㅋ','2025-11-27 10:02:17',NULL,'2025-11-27 10:03:15',0),(84,4,'user1','1','ㅁㅋㅋㅌㅊㅋ','2025-11-27 10:02:23',NULL,'2025-11-27 10:03:15',0),(85,4,'1','user1','zzzzzz','2025-11-27 10:03:18',NULL,'2025-11-27 10:04:22',0),(86,4,'1','user1','zzzzzzz','2025-11-27 10:04:18',NULL,'2025-11-27 10:04:22',0),(87,4,'user1','1','ㅋㅋㅋㅋㅌㅊㅋㅌㅊㅋㅌㅊㅋㅌㅊ','2025-11-27 10:04:25',NULL,'2025-11-27 10:05:48',0),(88,4,'1','user1','싸비~~','2025-11-27 10:05:54',NULL,'2025-11-27 10:06:42',0),(89,4,'user1','1','뭘봐','2025-11-27 10:05:56',NULL,'2025-11-27 10:06:03',0),(90,4,'1','user1','됬나영?','2025-11-27 10:06:07',NULL,'2025-11-27 10:06:42',0),(91,4,'1','user1','빸튜','2025-11-27 10:14:16',NULL,'2025-11-27 12:34:03',0),(92,4,'1','user1','ㅋㅋ','2025-11-27 10:38:21',NULL,'2025-11-27 12:34:03',0),(93,4,'1','user1','ㅋㅋ','2025-11-27 11:25:37',NULL,'2025-11-27 12:34:03',0),(94,4,'1','user1','ㅋㅋ','2025-11-27 11:54:19',NULL,'2025-11-27 12:34:03',0),(95,4,'1','user1','ㅋㅋ','2025-11-27 12:21:56',NULL,'2025-11-27 12:34:03',0),(96,4,'user1','1','zzzz','2025-11-27 12:34:06',NULL,'2025-11-27 12:34:12',0),(97,4,'1','user1','ㅋㅌㅊㅋㅌㅊ','2025-11-27 12:34:15',NULL,NULL,0);
/*!40000 ALTER TABLE `message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `message_room`
--

DROP TABLE IF EXISTS `message_room`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `message_room` (
  `room_no` int NOT NULL AUTO_INCREMENT COMMENT '대화방 고유번호',
  `user_id_a` varchar(50) NOT NULL COMMENT '참여자 A ID (user.id 참조)',
  `user_id_b` varchar(50) NOT NULL COMMENT '참여자 B ID (user.id 참조)',
  `message_room_created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '대화방 생성 일시',
  `last_message_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '마지막 메시지 전송 일시',
  PRIMARY KEY (`room_no`),
  UNIQUE KEY `uq_room_participants` (`user_id_a`,`user_id_b`),
  KEY `fk_room_user_b` (`user_id_b`),
  CONSTRAINT `fk_room_user_a` FOREIGN KEY (`user_id_a`) REFERENCES `user` (`id`),
  CONSTRAINT `fk_room_user_b` FOREIGN KEY (`user_id_b`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `message_room`
--

LOCK TABLES `message_room` WRITE;
/*!40000 ALTER TABLE `message_room` DISABLE KEYS */;
INSERT INTO `message_room` VALUES (1,'dev_user1','dev_user2','2025-10-15 11:40:29','2025-10-22 12:50:17'),(2,'1','dev_user1','2025-10-21 12:29:32','2025-11-26 11:08:59'),(3,'1','dev_user2','2025-10-21 14:00:37','2025-11-26 14:44:55'),(4,'user1','1','2025-10-22 12:53:52','2025-11-27 12:34:15'),(6,'1','dev_user3','2025-10-24 12:54:47','2025-11-26 11:09:04');
/*!40000 ALTER TABLE `message_room` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `point`
--

DROP TABLE IF EXISTS `point`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `point` (
  `point_no` int NOT NULL AUTO_INCREMENT COMMENT '포인트 기록 고유번호',
  `point_amount` int NOT NULL COMMENT '변동 포인트 값',
  `point_type` int NOT NULL COMMENT '적립,사용 구분 1:사용 2:획득',
  `point_reason` varchar(255) DEFAULT NULL COMMENT '포인트 상세내역',
  `point_created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '포인트 기록일시',
  `id` varchar(50) NOT NULL COMMENT '포인트 사용자 아이디 (user.id 참조)',
  `board_no` int DEFAULT NULL COMMENT '포인트 적립 관련 링크 (board.board_no 참조)',
  PRIMARY KEY (`point_no`),
  KEY `fk_point_user_id` (`id`),
  KEY `fk_point_board_no` (`board_no`),
  CONSTRAINT `fk_point_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`),
  CONSTRAINT `fk_point_user_id` FOREIGN KEY (`id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `point`
--

LOCK TABLES `point` WRITE;
/*!40000 ALTER TABLE `point` DISABLE KEYS */;
INSERT INTO `point` VALUES (1,1000,2,'답변 채택 보상','2025-10-15 11:40:29','dev_user2',1),(2,-500,1,'아이템 구매','2025-10-15 11:40:29','dev_user1',NULL),(17,10,2,'출석 보상','2025-10-24 17:14:49','1',NULL),(18,20,2,'댓글 작성 보상','2025-10-21 17:14:54','1',189),(19,300,2,'답변 채택 보상','2025-10-21 17:15:04','1',111),(20,20,2,'댓글 작성 보상','2025-10-21 17:15:07','1',121),(21,-50,1,'상품 구매 시 포인트 사용','2025-10-21 17:15:15','1',NULL),(22,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 09:49:15','1',NULL),(23,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 09:49:18','1',NULL),(24,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 09:49:22','1',NULL),(25,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 09:56:46','1',NULL),(26,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 09:58:49','1',NULL),(27,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 10:01:29','1',NULL),(28,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 10:03:38','1',NULL),(29,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 10:06:40','1',NULL),(30,-100,1,'아이템 구매: 고양이 아이콘','2025-11-28 10:09:04','1',NULL),(31,-500,1,'아이템 구매: 설산 배경','2025-11-28 10:23:35','user1',NULL);
/*!40000 ALTER TABLE `point` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `report`
--

DROP TABLE IF EXISTS `report`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `report` (
  `report_no` int NOT NULL AUTO_INCREMENT COMMENT '신고 기록 고유번호',
  `report_user_id` varchar(50) NOT NULL COMMENT '신고자 ID (user.id 참조)',
  `report_category` int NOT NULL COMMENT '신고 타입 1:욕설비방, 2:스팸/광고, 3:음란물, 4:도배',
  `report_content` text COMMENT '신고 상세 내용 (사용자 입력)',
  `board_no` int NOT NULL COMMENT '신고 대상 게시글 고유번호 (board.board_no 참조)',
  `reported_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '신고 접수일시',
  `report_status` int NOT NULL DEFAULT '1' COMMENT '처리 상태 1:대기중, 2:처리완료, 3:취소',
  `report_updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '처리 완료/수정 시각',
  PRIMARY KEY (`report_no`),
  KEY `fk_report_user_id` (`report_user_id`),
  KEY `fk_report_board_no` (`board_no`),
  CONSTRAINT `fk_report_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`),
  CONSTRAINT `fk_report_user_id` FOREIGN KEY (`report_user_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `report`
--

LOCK TABLES `report` WRITE;
/*!40000 ALTER TABLE `report` DISABLE KEYS */;
INSERT INTO `report` VALUES (1,'dev_user1',4,'내용이 도배성입니다.',3,'2025-10-15 11:40:29',1,'2025-10-15 11:40:29'),(2,'1',2,'스팸/광고',142,'2025-11-24 14:42:33',1,'2025-11-24 14:42:33'),(3,'1',2,'스팸/광고',3,'2025-11-27 14:45:48',1,'2025-11-27 14:45:48');
/*!40000 ALTER TABLE `report` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tag`
--

DROP TABLE IF EXISTS `tag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tag` (
  `tag_no` int NOT NULL AUTO_INCREMENT COMMENT '태그 고유 식별 번호',
  `tag_name` varchar(50) NOT NULL COMMENT '태그 이름 (예: MySQL, 설계, 팁)',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '태그 생성 일시',
  PRIMARY KEY (`tag_no`),
  UNIQUE KEY `tag_name` (`tag_name`)
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tag`
--

LOCK TABLES `tag` WRITE;
/*!40000 ALTER TABLE `tag` DISABLE KEYS */;
INSERT INTO `tag` VALUES (1,'MySQL','2025-10-15 11:40:29'),(2,'DB_설계','2025-10-15 11:40:29'),(3,'QNA','2025-10-15 11:40:29'),(4,'공지','2025-10-15 11:40:29'),(5,'팁','2025-10-15 11:40:29'),(6,'React','2025-10-15 11:40:29'),(7,'JavaScript','2025-10-15 11:40:29'),(8,'SpringBoot','2025-10-16 09:30:00'),(9,'CI_CD','2025-10-16 09:30:00'),(10,'SQL_튜닝','2025-10-16 09:30:00'),(11,'Docker','2025-10-16 09:30:00'),(12,'Security','2025-10-16 09:30:00'),(13,'Network','2025-10-16 09:30:00'),(14,'API_설계','2025-10-16 09:30:00'),(15,'바보','2025-10-20 16:33:24'),(16,'바보2','2025-10-20 16:33:24'),(17,'#멍청이','2025-10-20 16:34:00'),(18,'#우끼끼','2025-10-20 16:34:00'),(19,'#123','2025-10-20 16:34:00'),(20,'멍청이','2025-10-20 16:34:22'),(21,'우끼끼','2025-10-20 16:34:22'),(22,'123','2025-10-20 16:34:22'),(23,'ㄴㅇ1ㅀ','2025-10-20 16:35:26'),(25,'안녕','2025-10-20 16:35:40'),(26,'하세','2025-10-20 16:35:40'),(27,'요','2025-10-20 16:35:40'),(32,'ㅇㅇ','2025-10-20 18:22:35'),(33,'ㄷㄷ','2025-10-20 18:22:59'),(34,'ㅋㅋ','2025-10-20 18:22:59'),(35,'ㅍㅍ','2025-10-20 18:23:30'),(39,'ㄹ','2025-10-20 18:33:20'),(44,'ㅓㅓ','2025-10-21 09:13:05'),(45,'ㅏㅏ','2025-10-21 09:18:36'),(47,'ㅣㅣ','2025-10-21 09:24:11'),(54,'11','2025-10-21 09:55:25'),(56,'1234','2025-10-21 10:06:23'),(58,'안녕하세요','2025-10-21 10:21:12'),(60,'hi','2025-10-21 10:23:08'),(61,'test','2025-10-21 10:38:59'),(62,'나루토','2025-10-21 16:29:27'),(63,'사스케','2025-10-21 16:29:27'),(64,'수정','2025-10-21 17:09:25'),(65,'했다','2025-10-21 17:09:25'),(66,'삼성','2025-10-21 17:21:52'),(67,'갤럭시','2025-10-21 17:21:52'),(68,'asdf','2025-10-22 08:39:51'),(69,'asd1f','2025-10-22 08:40:38'),(70,'ddd','2025-10-22 08:40:38'),(71,'ㅎㅎ','2025-10-22 13:17:53'),(72,'ㅜㅜ','2025-10-22 13:17:53'),(73,';;','2025-10-22 13:17:53'),(74,'ㅁㅁ','2025-10-23 10:01:45'),(75,'ㄴㅇ','2025-10-23 10:01:45'),(76,'22','2025-10-23 11:20:42'),(77,'asd','2025-10-23 16:55:59'),(78,'sdf','2025-10-23 16:55:59'),(79,'공지사항','2025-10-24 09:55:52'),(80,'멘토님만세','2025-10-24 09:55:52'),(81,'선생님만세','2025-10-24 09:55:52'),(82,'입니다','2025-10-24 15:12:42'),(83,'python','2025-11-26 13:11:19'),(84,'tensorflow','2025-11-26 13:11:19'),(85,'spring','2025-11-26 13:11:19'),(86,'vue','2025-11-26 13:11:19'),(87,'nextjs','2025-11-26 13:11:19'),(88,'node','2025-11-26 13:11:19'),(89,'postgres','2025-11-26 13:11:19'),(90,'aws','2025-11-26 13:11:19'),(91,'kubernetes','2025-11-26 13:11:19'),(92,'java','2025-11-26 13:11:19'),(93,'mongodb','2025-11-26 13:11:19'),(94,'flask','2025-11-26 13:11:19'),(95,'fastapi','2025-11-26 13:11:19'),(96,'pytorch','2025-11-26 13:11:19'),(97,'oracle','2025-11-26 13:11:19'),(98,'sql','2025-11-26 13:11:19'),(99,'ai','2025-11-26 13:11:19'),(100,'12345','2025-11-27 10:00:39'),(101,'ajax','2025-11-27 10:02:34'),(102,'html','2025-11-27 10:03:55'),(103,'ㄴㅅ','2025-11-27 10:20:36'),(104,'ㅅㄷㅅ','2025-11-27 10:20:36'),(105,'파이썬','2025-11-27 10:25:51'),(106,'ML','2025-11-27 10:25:51'),(107,'에이작스','2025-11-27 10:27:59'),(108,'어렵당','2025-11-27 10:27:59'),(109,'ㅇ','2025-11-27 10:31:38'),(110,'ㄴㄴ','2025-11-27 10:33:24'),(111,'없음','2025-11-27 12:02:48'),(112,'1','2025-11-27 12:03:08'),(113,'ㅎ','2025-11-27 12:09:07'),(114,'ㅁㄴㅇㅎ','2025-11-27 13:01:40');
/*!40000 ALTER TABLE `tag` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tag_board`
--

DROP TABLE IF EXISTS `tag_board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tag_board` (
  `board_no` int NOT NULL COMMENT '게시글 고유번호 (board.board_no 참조)',
  `tag_no` int NOT NULL COMMENT '태그 고유 식별 번호 (tag.tag_no 참조)',
  PRIMARY KEY (`board_no`,`tag_no`),
  KEY `fk_map_tag_no` (`tag_no`),
  CONSTRAINT `fk_map_board_no` FOREIGN KEY (`board_no`) REFERENCES `board` (`board_no`),
  CONSTRAINT `fk_map_tag_no` FOREIGN KEY (`tag_no`) REFERENCES `tag` (`tag_no`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tag_board`
--

LOCK TABLES `tag_board` WRITE;
/*!40000 ALTER TABLE `tag_board` DISABLE KEYS */;
INSERT INTO `tag_board` VALUES (1,1),(145,1),(2,2),(4,2),(1,3),(3,4),(202,4),(2,5),(5,6),(144,6),(160,6),(181,6),(13,9),(2,10),(4,10),(9,10),(18,10),(13,11),(146,11),(163,11),(185,11),(37,12),(43,13),(22,14),(73,15),(192,15),(193,15),(73,16),(74,17),(74,18),(74,19),(75,20),(75,21),(75,22),(105,22),(107,22),(191,22),(76,23),(77,25),(77,26),(77,27),(82,32),(99,32),(106,32),(83,33),(83,34),(83,35),(84,39),(204,44),(100,45),(102,54),(107,54),(137,54),(95,56),(191,56),(96,58),(97,60),(99,61),(192,61),(193,61),(109,62),(109,63),(111,64),(111,65),(112,66),(112,67),(117,68),(117,69),(117,70),(132,71),(132,72),(132,73),(135,74),(135,75),(137,76),(139,77),(139,78),(140,79),(142,79),(140,80),(140,81),(142,82),(143,83),(149,83),(165,83),(170,83),(187,83),(195,83),(147,84),(168,84),(148,85),(169,85),(150,86),(171,86),(152,87),(173,87),(153,88),(174,88),(154,89),(175,89),(155,90),(176,90),(156,91),(166,91),(177,91),(188,91),(157,92),(178,92),(158,93),(179,93),(155,94),(159,94),(176,94),(180,94),(149,95),(162,97),(184,97),(147,99),(151,99),(161,99),(167,99),(168,99),(172,99),(183,99),(189,99),(191,100),(192,101),(193,102),(194,103),(194,104),(195,105),(195,106),(198,109),(199,110),(196,111),(200,112),(201,113),(203,114);
/*!40000 ALTER TABLE `tag_board` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` varchar(50) NOT NULL COMMENT '아이디',
  `name` varchar(50) DEFAULT NULL COMMENT '이름',
  `nick` varchar(50) NOT NULL COMMENT '닉네임',
  `email` varchar(255) NOT NULL COMMENT '이메일',
  `password` varchar(255) NOT NULL COMMENT '비밀번호',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '가입일시',
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '수정일시',
  `last_login_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '마지막 로그인',
  `user_type` int NOT NULL DEFAULT '2' COMMENT '1:관리자 2:일반회원 3:차단회원',
  `icon` varchar(255) DEFAULT NULL COMMENT '유저 아이콘',
  `background_img` varchar(255) DEFAULT NULL COMMENT '배경 이미지',
  `insignia` varchar(255) DEFAULT NULL COMMENT '휘장',
  `withdraw_at` datetime DEFAULT NULL COMMENT '탈퇴일시',
  `withdraw` tinyint(1) NOT NULL DEFAULT '0' COMMENT '탈퇴여부',
  `user_current_point` int NOT NULL DEFAULT '0' COMMENT '현재 잔여 포인트',
  PRIMARY KEY (`id`),
  UNIQUE KEY `nick` (`nick`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('1','마스터','마스터1','jjibask@naver.com','1','2025-10-15 15:04:44','2025-11-28 16:35:53','2025-11-28 16:35:54',1,NULL,'backgrounds/idol.png',NULL,NULL,0,53100),('1111','1111','1111','1111@1111','1111','2025-11-28 16:17:41','2025-11-28 16:20:04','2025-11-28 16:20:04',2,NULL,NULL,NULL,NULL,0,0),('123','김철수','철수마스터','chul@example.com','123','2025-10-23 10:49:23','2025-11-24 15:36:26','2025-11-24 15:36:26',2,NULL,NULL,NULL,'2025-10-23 11:34:36',1,10),('1234','기모띠','가버렷','asdfg@asdg.com','a12341234@','2025-10-24 09:46:08','2025-10-24 09:46:08','2025-10-24 09:46:23',2,NULL,NULL,NULL,NULL,0,0),('admin','정지인','관리자','jjibask11@naver.com','123456!','2025-10-15 14:11:44','2025-10-23 17:39:31','2025-10-23 17:37:59',1,NULL,NULL,NULL,NULL,0,0),('admin_user','관리자','운영팀장','admin@test.com','hashed_admin_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',1,NULL,NULL,NULL,NULL,0,0),('admin_user1','관리자2','운영팀원','admin2@test.com','hashed_admin_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',1,NULL,NULL,NULL,NULL,0,0),('aezen','정지인','어젠일반인','jjibask1@naver.com','aezen123@','2025-10-24 09:49:34','2025-10-24 09:49:34','2025-10-24 09:50:39',2,NULL,NULL,NULL,NULL,0,0),('aezen1','어젠','nick','dovin@naver.com','qkqhqkqh!!12','2025-10-24 15:06:37','2025-10-24 15:06:37','2025-10-24 15:06:53',2,NULL,NULL,NULL,NULL,0,0),('dev_user1','개발자김','테스터1','dev1@test.com','hashed_dev1_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',2,NULL,NULL,NULL,NULL,0,-500),('dev_user2','개발자박','테스터2','dev2@test.com','hashed_dev2_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',2,NULL,NULL,NULL,NULL,0,1000),('dev_user3','개발자이','테스터3','dev3@test.com','hashed_dev3_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',2,NULL,NULL,NULL,NULL,0,0),('dev_user4','개발자최','테스터4','dev4@test.com','hashed_dev4_pw','2025-10-15 11:40:29','2025-10-15 11:40:29','2025-10-15 11:40:29',2,NULL,NULL,NULL,NULL,0,0),('ezen_user123','이젠 테스트','젠이테스터','ezen.tester@example.com','937e8d5fbb48bd4949536cd65b8d35c426b80d2f830c5c308e2cdec422ae2244','2025-10-17 16:03:07','2025-10-17 16:03:07','2025-10-17 16:03:07',2,NULL,NULL,NULL,NULL,0,1000),('user001','김민준','프론트장인','user001@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user002','이서준','백엔드도적','user002@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user003','박서연','디자인좋아함','user003@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user004','최지우','코딩만랩','user004@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user005','정하린','데이터맛집','user005@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user006','홍준영','AI덕후','user006@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user007','오세은','파이썬고수','user007@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user008','윤재현','자바마스터','user008@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user009','서다인','JS이즈갓','user009@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user010','한지훈','리액트소년','user010@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user011','문하준','스프링전문가','user011@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user012','장하율','알고리즘장인','user012@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user013','조민서','DB전문가','user013@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user014','배민규','SQL전사','user014@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user015','임수아','Vue초고수','user015@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user016','강예린','Node탑랭커','user016@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user017','유도현','AWS매니아','user017@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user018','전예준','클라우드신','user018@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user019','나채린','HTML요정','user019@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user020','서우빈','CSS마녀','user020@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user021','정시윤','UX연구가','user021@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user022','표은재','풀스택꿈나무','user022@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user023','최윤아','도커수집가','user023@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user024','장도완','쿠버네티스전사','user024@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user025','고은채','텐서플로우연구','user025@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user026','이하린','ML개발자','user026@example.com','test1234','2025-11-26 14:55:04','2025-11-26 15:21:53','2025-11-26 15:21:54',2,NULL,NULL,NULL,NULL,0,0),('user027','김하윤','AI연구원','user027@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user028','신민혁','로우레벨고수','user028@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user029','허유진','웹퍼블리셔','user029@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user030','황도윤','게임개발자','user030@example.com','test1234','2025-11-26 14:55:04','2025-11-26 14:55:04','2025-11-26 14:55:04',2,NULL,NULL,NULL,NULL,0,0),('user1','일반사용자','일반닉1','user1@aezen.com','1','2025-10-15 15:03:10','2025-11-28 16:35:32','2025-11-28 16:35:33',2,NULL,'backgrounds/snow.png','backgrounds/snow.png','2025-10-24 15:11:32',0,4500);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_interest_vector`
--

DROP TABLE IF EXISTS `user_interest_vector`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_interest_vector` (
  `user_id` varchar(50) NOT NULL,
  `vector_json` longtext NOT NULL,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`),
  CONSTRAINT `fk_interest_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_interest_vector`
--

LOCK TABLES `user_interest_vector` WRITE;
/*!40000 ALTER TABLE `user_interest_vector` DISABLE KEYS */;
INSERT INTO `user_interest_vector` VALUES ('1','[-0.04128570109605789, 0.0355391800403595, 0.009809448383748531, -0.0132078155875206, -0.014313834719359875, -0.0311873909085989, 0.06760026514530182, 0.030526919290423393, -0.007737673819065094, -0.02784220688045025, 0.05514172464609146, -0.016446871683001518, 0.038961801677942276, -0.007411756552755833, 0.003265323815867305, -0.02961990050971508, 0.0009868326596915722, -0.02057325653731823, -0.05489616468548775, -0.03913946822285652, -0.005936774890869856, -0.0011912885820493102, 0.011942019686102867, 0.006357898935675621, -0.030807698145508766, -0.005929051898419857, -0.006639307364821434, 0.0021741550881415606, 0.03292073681950569, -0.02640639804303646, -0.001391298370435834, 0.0411713682115078, 0.026226261630654335, 0.0013284414308145642, -0.036524489521980286, -0.00016359433357138187, -0.02038976550102234, -0.016426846385002136, -0.02094055339694023, 0.03222566843032837, -0.06980148702859879, -0.07123003154993057, 0.039057064801454544, -0.04293709620833397, 0.04126167669892311, 0.009684343822300434, -0.05002530664205551, -0.017095446586608887, -0.004699531011283398, 0.009670631028711796, -0.04897795617580414, -0.01114201731979847, -0.016771944239735603, -0.019280394539237022, 0.013681556098163128, -0.009097497910261154, -0.04884439706802368, -0.008277316577732563, 0.0004952955059707165, 0.007772261276841164, 0.016949495300650597, 0.012236683629453182, -0.029208723455667496, 0.03677873685956001, 0.021097317337989807, -0.00503129605203867, -0.0036653061397373676, -0.005685809534043074, 0.010476147755980492, -0.0002227795048383996, 0.011167239397764206, 3.267805004725233e-05, -0.0029249992221593857, -0.0043358090333640575, -0.030097778886556625, -0.013126229867339134, 0.018943844363093376, -0.015415224246680737, 0.018738893792033195, 0.013500808738172054, -0.009400203824043274, -0.00962049514055252, -0.012468633241951466, 0.019841991364955902, -0.024477284401655197, -0.01553434319794178, -0.014428631402552128, 0.02318650297820568, -0.034453023225069046, 0.02990810200572014, 0.01038297452032566, 0.03813496604561806, -0.0026355700101703405, 0.007339797914028168, -0.05548344552516937, 0.02536541409790516, -0.013161076232790947, -0.022523490712046623, -0.02948020212352276, 0.0923820286989212, 0.013897256925702095, 0.03550713509321213, 0.0001226187450811267, 0.028534667566418648, -0.04531727731227875, -0.013585992157459259, 0.030365269631147385, -0.014138247817754745, 0.02583576925098896, -0.008617820218205452, -0.050361670553684235, -0.042090170085430145, -0.0470237135887146, -0.03866952285170555, 0.013105930760502815, -0.011949037201702595, 0.0015488768694922328, 0.002873003715649247, -0.006832819432020187, 0.0078729884698987, 0.036062177270650864, -0.0042668599635362625, -0.025496672838926315, -0.02120961807668209, -0.0403095968067646, -0.028629254549741745, 0.0326804593205452, 1.3024147717679738e-33, -0.035574525594711304, -0.012835945002734661, 0.016405245289206505, -0.0008426709100604057, -0.02416655234992504, 0.013854303397238255, -0.03533247485756874, -0.006640545092523098, -0.0333700068295002, 0.0038145442958921194, -0.01879524625837803, -0.004193047061562538, -0.05842536315321922, -0.008530469611287117, 0.03486025705933571, -0.004891886375844479, -0.0009924090700224042, 0.03916973993182182, -0.0121909249573946, 0.019141247496008873, 0.02572593279182911, -0.007058555725961924, 0.012083870358765125, 0.002585208509117365, 0.012720175087451935, -0.00046872260281816125, 0.02736877091228962, -0.03279084712266922, -0.015577005222439766, 0.02561240643262863, 0.02072678506374359, -0.013556201010942459, -0.034631334245204926, -0.006153815891593695, -0.03399747982621193, -0.02461891807615757, 0.014773375354707241, -0.006008187774568796, 0.0055937995202839375, -0.012634700164198875, -0.0053841290064156055, -0.005883559584617615, -0.03511134162545204, 0.010875684209167957, 0.015671327710151672, 0.05149230360984802, 0.03233513608574867, -0.020943673327565193, 0.014239886775612831, 0.009707205928862095, -0.04317645728588104, 0.018144525587558746, -0.03222178667783737, 0.020023446530103683, 0.026838677003979683, 0.005694363731890917, 0.04923199489712715, 0.001034479821100831, -0.04084165394306183, 0.01084325835108757, -0.0050089373253285885, 0.022593442350625992, -0.019350877031683922, -0.012176364660263062, 0.008808141574263573, -0.013221995905041695, 0.009545656852424145, -0.01356288231909275, 0.03658486530184746, -0.018672676756978035, -0.024725988507270813, -0.002598595805466175, 0.03612707927823067, 0.03631354495882988, -0.05822762846946716, -0.023048793897032738, -0.023044893518090248, 0.005484167952090502, 0.013750651851296425, -0.004581859335303307, -0.027377113699913025, -0.003084397641941905, -0.018517715856432915, -0.04741353541612625, 0.04081035405397415, 0.00658197607845068, 0.008832039311528206, -0.042076949030160904, 0.014874693937599659, 0.01169284526258707, -0.05309007316827774, 0.0062377010472118855, 0.03758861497044563, 0.006541259121149778, -0.01833156682550907, -3.777611624814705e-33, 0.00019354582764208317, 0.037305086851119995, -0.03878606855869293, 0.046257417649030685, 0.009635020047426224, 0.010211015120148659, 0.022825516760349274, 0.03862219676375389, 0.010105845518410206, 0.039157602936029434, 0.007009158842265606, -0.014981670305132866, 0.020207315683364868, 0.01409732922911644, 0.004851802252233028, 0.014955579303205013, 0.014727946370840073, 0.001188035705126822, -0.03426777943968773, 0.017435042187571526, -0.024930739775300026, 0.036380890756845474, -0.019697265699505806, 0.03916314244270325, -0.02678140439093113, 0.014911470003426075, 0.024080142378807068, -0.004187932703644037, -0.029823441058397293, -0.005248216912150383, 0.01729167439043522, -0.0352340042591095, -0.027974899858236313, 0.03589940443634987, 0.0070809596218168736, -0.03830330818891525, 0.03438024967908859, -0.010130491107702255, -0.012210673652589321, -0.009813901968300343, 0.043808020651340485, 0.0047452691942453384, 0.021287545561790466, 0.015426451340317726, -0.02121185138821602, -0.0071699609979987144, -0.026017727330327034, -0.0077948435209691525, 0.007044016383588314, -0.0349050834774971, 0.020189225673675537, -0.030772127211093903, -0.0003120019973721355, -0.03622345253825188, 0.02024431899189949, 0.01208244077861309, 0.019213974475860596, 0.017767079174518585, -0.014267927035689354, 0.006792805623263121, 0.00924420915544033, -0.01273415982723236, -0.009086343459784985, 0.0171856377273798, -0.003800302045419812, -0.0038562885019928217, 0.008617536164820194, 0.0067868647165596485, 0.006549565587192774, -0.016087470576167107, 0.05263231322169304, 0.02448178268969059, 0.013300633989274502, 0.021885162219405174, -0.03718243166804314, -0.021288417279720306, -0.012841606512665749, 0.02221366949379444, 0.02643856219947338, -0.013581312261521816, -0.04957751929759979, 0.01884450763463974, -0.004287744406610727, -0.007901264354586601, -0.03055376000702381, -0.0445374920964241, 0.018754860386252403, 0.021913081407546997, -0.009405355900526047, -0.013025091029703617, -0.016629204154014587, 0.04653950035572052, 0.007975146174430847, 0.006366710644215345, -0.01071231346577406, -3.134233850232704e-08, -0.019820237532258034, -0.04601307585835457, 0.01950729824602604, -0.0028579782228916883, 0.01652444340288639, 0.0062641059048473835, -0.020372610539197922, 0.007053054869174957, 0.009607761166989803, -0.021232018247246742, 0.0443609356880188, 0.007839282043278217, -0.016083041206002235, 0.045348312705755234, 0.00682594021782279, -0.04371379315853119, 0.004057006910443306, 0.06253880262374878, -0.006668120622634888, -0.03293679282069206, 0.05070966109633446, -0.006177263800054789, -0.020803382620215416, -0.0025076994206756353, -0.014905555173754692, 0.02905338816344738, -0.024476319551467896, 0.046984147280454636, -0.010901933535933495, -0.022003477439284325, -0.0017226922791451216, -0.0028028374072164297, -0.0006263367831707001, -0.01040886715054512, 0.003463547909632325, 0.0013070732820779085, -2.1891699361731298e-05, 0.019160248339176178, 0.00017257986473850906, 0.031022312119603157, -0.014570449478924274, -0.023510700091719627, 0.010278420522809029, -0.0015238054329529405, -0.006049131043255329, -0.012427492998540401, 0.018594786524772644, -0.026082953438162804, -0.021695617586374283, 0.004726203624159098, -0.011361661367118359, -0.010084923356771469, 0.0142194340005517, 0.01722169667482376, 0.04240715876221657, 0.01431726198643446, 0.012409249320626259, 0.012516386806964874, 0.0022085560485720634, 0.025300631299614906, 0.06284576654434204, 0.01818959042429924, -0.016888722777366638, 0.003881901502609253]','2025-11-28 16:50:30');
/*!40000 ALTER TABLE `user_interest_vector` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_interests`
--

DROP TABLE IF EXISTS `user_interests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_interests` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` varchar(50) NOT NULL,
  `interest` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `user_interests_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_interests`
--

LOCK TABLES `user_interests` WRITE;
/*!40000 ALTER TABLE `user_interests` DISABLE KEYS */;
INSERT INTO `user_interests` VALUES (6,'1111','웹개발');
/*!40000 ALTER TABLE `user_interests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_item`
--

DROP TABLE IF EXISTS `user_item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_item` (
  `user_id` varchar(50) NOT NULL,
  `item_no` int NOT NULL,
  `is_equipped` tinyint(1) NOT NULL DEFAULT '0',
  `acquired_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`,`item_no`),
  KEY `fk_user_item_item` (`item_no`),
  CONSTRAINT `fk_user_item_item` FOREIGN KEY (`item_no`) REFERENCES `item` (`item_no`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_user_item_user` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_item`
--

LOCK TABLES `user_item` WRITE;
/*!40000 ALTER TABLE `user_item` DISABLE KEYS */;
INSERT INTO `user_item` VALUES ('1',1,0,'2025-11-28 10:09:04'),('1',2,0,'2025-11-26 11:05:49'),('1',3,0,'2025-11-26 11:05:49'),('1',4,1,'2025-11-27 15:10:02'),('user1',1,0,'2025-11-26 11:05:49'),('user1',3,0,'2025-11-28 10:23:35');
/*!40000 ALTER TABLE `user_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_skills`
--

DROP TABLE IF EXISTS `user_skills`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_skills` (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` varchar(50) NOT NULL,
  `skill` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `user_skills_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_skills`
--

LOCK TABLES `user_skills` WRITE;
/*!40000 ALTER TABLE `user_skills` DISABLE KEYS */;
INSERT INTO `user_skills` VALUES (6,'1111','Python');
/*!40000 ALTER TABLE `user_skills` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'aezen'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-11-28 16:56:57
